/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    storage: Storage,
    align: [Align; 0],
}

impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }

    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];

        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };

        let mask = 1 << bit_index;

        byte & mask == mask
    }

    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];

        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };

        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }

    #[inline]

pub const ERR_CCM_HW_ACCEL_FAILED: i32 = -17;
pub const CAMELLIA_ENCRYPT: u32 = 1;
pub const CAMELLIA_DECRYPT: u32 = 0;
pub const ERR_CAMELLIA_BAD_INPUT_DATA: i32 = -36;
pub const ERR_CAMELLIA_INVALID_INPUT_LENGTH: i32 = -38;
pub const ERR_CAMELLIA_HW_ACCEL_FAILED: i32 = -39;
pub const MULADDC_CORE : & 'static [ u8 ; 176usize ] = b"movq   (%%rsi), %%rax\nmulq   %%rbx\naddq   $8, %%rsi\naddq   %%rcx, %%rax\nmovq   %%r8, %%rcx\nadcq   $0, %%rdx\nnop    \naddq   %%rax, (%%rdi)\nadcq   %%rdx, %%rcx\naddq   $8, %%rdi\n\0" ;
pub const BLOWFISH_ENCRYPT: u32 = 1;
pub const BLOWFISH_DECRYPT: u32 = 0;
pub const BLOWFISH_MAX_KEY_BITS: u32 = 448;
pub const BLOWFISH_MIN_KEY_BITS: u32 = 32;
pub const BLOWFISH_ROUNDS: u32 = 16;
pub const BLOWFISH_BLOCKSIZE: u32 = 8;
pub const ERR_BLOWFISH_BAD_INPUT_DATA: i32 = -22;
pub const ERR_BLOWFISH_INVALID_INPUT_LENGTH: i32 = -24;
pub const ERR_BLOWFISH_HW_ACCEL_FAILED: i32 = -23;
pub const ERR_BASE64_BUFFER_TOO_SMALL: i32 = -42;
pub const ERR_BASE64_INVALID_CHARACTER: i32 = -44;
pub const ARIA_ENCRYPT: u32 = 1;
pub const ARIA_DECRYPT: u32 = 0;
pub const ARIA_BLOCKSIZE: u32 = 16;
pub const ARIA_MAX_ROUNDS: u32 = 16;
pub const ARIA_MAX_KEYSIZE: u32 = 32;
pub const ERR_ARIA_BAD_INPUT_DATA: i32 = -92;
pub const ERR_ARIA_INVALID_INPUT_LENGTH: i32 = -94;
pub const ERR_ARIA_FEATURE_UNAVAILABLE: i32 = -90;
pub const ERR_ARIA_HW_ACCEL_FAILED: i32 = -88;
pub const ERR_ARC4_HW_ACCEL_FAILED: i32 = -25;
pub const AESNI_AES: u32 = 33554432;
pub const AESNI_CLMUL: u32 = 2;
extern "C" {
    #[link_name = "mbedtls_printf"]
    pub fn printf(format: *const raw_types::c_char, ...) -> raw_types::c_int;
}
pub type iso_c_forbids_empty_translation_units = raw_types::c_int;
pub type wchar_t = raw_types::c_int;
pub type __u_char = raw_types::c_uchar;
pub type __u_short = raw_types::c_ushort;
pub type __u_int = raw_types::c_uint;
pub type __u_long = raw_types::c_ulong;
pub type __int8_t = raw_types::c_schar;
pub type __uint8_t = raw_types::c_uchar;
pub type __int16_t = raw_types::c_short;
pub type __uint16_t = raw_types::c_ushort;
pub type __int32_t = raw_types::c_int;
pub type __uint32_t = raw_types::c_uint;
pub type __int64_t = raw_types::c_long;
pub type __uint64_t = raw_types::c_ulong;
pub type __quad_t = raw_types::c_long;
pub type __u_quad_t = raw_types::c_ulong;
pub type __intmax_t = raw_types::c_long;
pub type __uintmax_t = raw_types::c_ulong;
pub type __dev_t = raw_types::c_ulong;
pub type __uid_t = raw_types::c_uint;
pub type __gid_t = raw_types::c_uint;
pub type __ino_t = raw_types::c_ulong;
pub type __ino64_t = raw_types::c_ulong;
pub type __mode_t = raw_types::c_uint;
pub type __nlink_t = raw_types::c_ulong;
pub type __off_t = raw_types::c_long;
pub type __off64_t = raw_types::c_long;
pub type __pid_t = raw_types::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __fsid_t {
    pub __val: [raw_types::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = raw_types::c_long;
pub type __rlim_t = raw_types::c_ulong;
pub type __rlim64_t = raw_types::c_ulong;
pub type __id_t = raw_types::c_uint;
pub type __time_t = raw_types::c_long;
pub type __useconds_t = raw_types::c_uint;
pub type __suseconds_t = raw_types::c_long;
pub type __daddr_t = raw_types::c_int;
pub type __key_t = raw_types::c_int;
pub type __clockid_t = raw_types::c_int;
pub type __timer_t = *mut raw_types::c_void;
pub type __blksize_t = raw_types::c_long;
pub type __blkcnt_t = raw_types::c_long;
pub type __blkcnt64_t = raw_types::c_long;
pub type __fsblkcnt_t = raw_types::c_ulong;
pub type __fsblkcnt64_t = raw_types::c_ulong;
pub type __fsfilcnt_t = raw_types::c_ulong;
pub type __fsfilcnt64_t = raw_types::c_ulong;
pub type __fsword_t = raw_types::c_long;
pub type __ssize_t = raw_types::c_long;
pub type __syscall_slong_t = raw_types::c_long;
pub type __syscall_ulong_t = raw_types::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut raw_types::c_char;
pub type __intptr_t = raw_types::c_long;
pub type __socklen_t = raw_types::c_uint;
pub type __sig_atomic_t = raw_types::c_int;
pub type int_least8_t = raw_types::c_schar;
pub type int_least16_t = raw_types::c_short;
pub type int_least32_t = raw_types::c_int;
pub type int_least64_t = raw_types::c_long;
pub type uint_least8_t = raw_types::c_uchar;
pub type uint_least16_t = raw_types::c_ushort;
pub type uint_least32_t = raw_types::c_uint;
pub type uint_least64_t = raw_types::c_ulong;
pub type int_fast8_t = raw_types::c_schar;
pub type int_fast16_t = raw_types::c_long;
pub type int_fast32_t = raw_types::c_long;
pub type int_fast64_t = raw_types::c_long;
pub type uint_fast8_t = raw_types::c_uchar;
pub type uint_fast16_t = raw_types::c_ulong;
pub type uint_fast32_t = raw_types::c_ulong;
pub type uint_fast64_t = raw_types::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: raw_types::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: raw_types::c_uint,
    pub __wchb: [raw_types::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::core::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::core::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = raw_types::c_void;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: raw_types::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(
        ::core::mem::size_of::<_IO_marker>(),
        24usize,
        concat!("Size of: ", stringify!(_IO_marker))
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_marker>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_marker))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_marker>()))._next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_marker>()))._sbuf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_sbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_marker>()))._pos as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_pos)
        )
    );
}
pub const __codecvt_ok: __codecvt_result = 0;
pub const __codecvt_partial: __codecvt_result = 1;
pub const __codecvt_error: __codecvt_result = 2;
pub const __codecvt_noconv: __codecvt_result = 3;
pub type __codecvt_result = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: raw_types::c_int,
    pub _IO_read_ptr: *mut raw_types::c_char,
    pub _IO_read_end: *mut raw_types::c_char,
    pub _IO_read_base: *mut raw_types::c_char,
    pub _IO_write_base: *mut raw_types::c_char,
    pub _IO_write_ptr: *mut raw_types::c_char,
    pub _IO_write_end: *mut raw_types::c_char,
    pub _IO_buf_base: *mut raw_types::c_char,
    pub _IO_buf_end: *mut raw_types::c_char,
    pub _IO_save_base: *mut raw_types::c_char,
    pub _IO_backup_base: *mut raw_types::c_char,
    pub _IO_save_end: *mut raw_types::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: raw_types::c_int,
    pub _flags2: raw_types::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: raw_types::c_ushort,
    pub _vtable_offset: raw_types::c_schar,
    pub _shortbuf: [raw_types::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut raw_types::c_void,
    pub __pad2: *mut raw_types::c_void,
    pub __pad3: *mut raw_types::c_void,
    pub __pad4: *mut raw_types::c_void,
    pub __pad5: usize,
    pub _mode: raw_types::c_int,
    pub _unused2: [raw_types::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::core::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad1 as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad2 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad3 as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad4 as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "_IO_2_1_stdin_"]
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stdout_"]
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stderr_"]
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn = ::core::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut raw_types::c_void,
        __buf: *mut raw_types::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type __io_write_fn = ::core::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut raw_types::c_void,
        __buf: *const raw_types::c_char,
        __n: usize,
    ) -> __ssize_t,
>;
pub type __io_seek_fn = ::core::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut raw_types::c_void,
        __pos: *mut __off64_t,
        __w: raw_types::c_int,
    ) -> raw_types::c_int,
>;
pub type __io_close_fn = ::core::option::Option<
    unsafe extern "C" fn(__cookie: *mut raw_types::c_void) -> raw_types::c_int,
>;
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut _IO_FILE, arg2: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn _IO_putc(__c: raw_types::c_int, __fp: *mut _IO_FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(
        arg1: *mut _IO_FILE,
        arg2: *const raw_types::c_char,
        arg3: *mut __va_list_tag,
        arg4: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(
        arg1: *mut _IO_FILE,
        arg2: *const raw_types::c_char,
        arg3: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: raw_types::c_int, arg3: __ssize_t) -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(arg1: *mut _IO_FILE, arg2: *mut raw_types::c_void, arg3: usize) -> usize;
}
extern "C" {
    pub fn _IO_seekoff(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: raw_types::c_int,
        arg4: raw_types::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(arg1: *mut _IO_FILE, arg2: __off64_t, arg3: raw_types::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type off_t = __off_t;
pub type fpos_t = _G_fpos_t;
extern "C" {
    #[link_name = "stdin"]
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stdout"]
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stderr"]
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(__filename: *const raw_types::c_char) -> raw_types::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const raw_types::c_char,
        __new: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: raw_types::c_int,
        __old: *const raw_types::c_char,
        __newfd: raw_types::c_int,
        __new: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut raw_types::c_char) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut raw_types::c_char) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const raw_types::c_char,
        __pfx: *const raw_types::c_char,
    ) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const raw_types::c_char,
        __modes: *const raw_types::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const raw_types::c_char,
        __modes: *const raw_types::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: raw_types::c_int, __modes: *const raw_types::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut raw_types::c_void,
        __len: usize,
        __modes: *const raw_types::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut raw_types::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut raw_types::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut raw_types::c_char,
        __modes: raw_types::c_int,
        __n: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut raw_types::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const raw_types::c_char,
        ...
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "printf"]
    pub fn printf1(__format: *const raw_types::c_char, ...) -> raw_types::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut raw_types::c_char,
        __format: *const raw_types::c_char,
        ...
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const raw_types::c_char,
        __arg: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const raw_types::c_char,
        __arg: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut raw_types::c_char,
        __format: *const raw_types::c_char,
        __arg: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut raw_types::c_char,
        __maxlen: usize,
        __format: *const raw_types::c_char,
        ...
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut raw_types::c_char,
        __maxlen: usize,
        __format: *const raw_types::c_char,
        __arg: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: raw_types::c_int,
        __fmt: *const raw_types::c_char,
        __arg: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: raw_types::c_int,
        __fmt: *const raw_types::c_char,
        ...
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn fscanf(__stream: *mut FILE, __format: *const raw_types::c_char, ...)
        -> raw_types::c_int;
}
extern "C" {
    pub fn scanf(__format: *const raw_types::c_char, ...) -> raw_types::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const raw_types::c_char,
        __format: *const raw_types::c_char,
        ...
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const raw_types::c_char,
        ...
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "__isoc99_scanf"]
    pub fn scanf1(__format: *const raw_types::c_char, ...) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const raw_types::c_char,
        __format: *const raw_types::c_char,
        ...
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const raw_types::c_char,
        __arg: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const raw_types::c_char,
        __arg: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const raw_types::c_char,
        __format: *const raw_types::c_char,
        __arg: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const raw_types::c_char,
        __arg: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const raw_types::c_char,
        __arg: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const raw_types::c_char,
        __format: *const raw_types::c_char,
        __arg: *mut __va_list_tag,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn getchar() -> raw_types::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> raw_types::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn fputc(__c: raw_types::c_int, __stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn putc(__c: raw_types::c_int, __stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn putchar(__c: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: raw_types::c_int, __stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: raw_types::c_int, __stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn putw(__w: raw_types::c_int, __stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut raw_types::c_char,
        __n: raw_types::c_int,
        __stream: *mut FILE,
    ) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut raw_types::c_char,
        __n: *mut usize,
        __delimiter: raw_types::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut raw_types::c_char,
        __n: *mut usize,
        __delimiter: raw_types::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut raw_types::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const raw_types::c_char, __stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn puts(__s: *const raw_types::c_char) -> raw_types::c_int;
}
extern "C" {
    pub fn ungetc(__c: raw_types::c_int, __stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut raw_types::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> raw_types::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const raw_types::c_void,
        __size: usize,
        __n: usize,
        __s: *mut FILE,
    ) -> raw_types::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut raw_types::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const raw_types::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: raw_types::c_long,
        __whence: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> raw_types::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> raw_types::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> raw_types::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn perror(__s: *const raw_types::c_char);
}
extern "C" {
    #[link_name = "sys_nerr"]
    pub static mut sys_nerr: raw_types::c_int;
}
extern "C" {
    #[link_name = "sys_errlist"]
    pub static mut sys_errlist: [*const raw_types::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const raw_types::c_char,
        __modes: *const raw_types::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut raw_types::c_char) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
pub type mpi_sint = i64;
pub type mpi_uint = u64;
pub type t_udbl = raw_types::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mpi {
    pub s: raw_types::c_int,
    pub n: usize,
    pub p: *mut mpi_uint,
}
#[test]
fn bindgen_test_layout_mpi() {
    assert_eq!(
        ::core::mem::size_of::<mpi>(),
        24usize,
        concat!("Size of: ", stringify!(mpi))
    );
    assert_eq!(
        ::core::mem::align_of::<mpi>(),
        8usize,
        concat!("Alignment of ", stringify!(mpi))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mpi>())).s as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(mpi), "::", stringify!(s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mpi>())).n as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(mpi), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mpi>())).p as *const _ as usize },
        16usize,
        concat!("Offset of field: ", stringify!(mpi), "::", stringify!(p))
    );
}
extern "C" {
    #[link_name = "mbedtls_mpi_init"]
    pub fn mpi_init(X: *mut mpi);
}
extern "C" {
    #[link_name = "mbedtls_mpi_free"]
    pub fn mpi_free(X: *mut mpi);
}
extern "C" {
    #[link_name = "mbedtls_mpi_grow"]
    pub fn mpi_grow(X: *mut mpi, nblimbs: usize) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_shrink"]
    pub fn mpi_shrink(X: *mut mpi, nblimbs: usize) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_copy"]
    pub fn mpi_copy(X: *mut mpi, Y: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_swap"]
    pub fn mpi_swap(X: *mut mpi, Y: *mut mpi);
}
extern "C" {
    #[link_name = "mbedtls_mpi_safe_cond_assign"]
    pub fn mpi_safe_cond_assign(
        X: *mut mpi,
        Y: *const mpi,
        assign: raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_safe_cond_swap"]
    pub fn mpi_safe_cond_swap(
        X: *mut mpi,
        Y: *mut mpi,
        assign: raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_lset"]
    pub fn mpi_lset(X: *mut mpi, z: mpi_sint) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_get_bit"]
    pub fn mpi_get_bit(X: *const mpi, pos: usize) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_set_bit"]
    pub fn mpi_set_bit(X: *mut mpi, pos: usize, val: raw_types::c_uchar) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_lsb"]
    pub fn mpi_lsb(X: *const mpi) -> usize;
}
extern "C" {
    #[link_name = "mbedtls_mpi_bitlen"]
    pub fn mpi_bitlen(X: *const mpi) -> usize;
}
extern "C" {
    #[link_name = "mbedtls_mpi_size"]
    pub fn mpi_size(X: *const mpi) -> usize;
}
extern "C" {
    #[link_name = "mbedtls_mpi_read_string"]
    pub fn mpi_read_string(
        X: *mut mpi,
        radix: raw_types::c_int,
        s: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_write_string"]
    pub fn mpi_write_string(
        X: *const mpi,
        radix: raw_types::c_int,
        buf: *mut raw_types::c_char,
        buflen: usize,
        olen: *mut usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_read_file"]
    pub fn mpi_read_file(X: *mut mpi, radix: raw_types::c_int, fin: *mut FILE) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_write_file"]
    pub fn mpi_write_file(
        p: *const raw_types::c_char,
        X: *const mpi,
        radix: raw_types::c_int,
        fout: *mut FILE,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_read_binary"]
    pub fn mpi_read_binary(
        X: *mut mpi,
        buf: *const raw_types::c_uchar,
        buflen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_write_binary"]
    pub fn mpi_write_binary(
        X: *const mpi,
        buf: *mut raw_types::c_uchar,
        buflen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_shift_l"]
    pub fn mpi_shift_l(X: *mut mpi, count: usize) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_shift_r"]
    pub fn mpi_shift_r(X: *mut mpi, count: usize) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_cmp_abs"]
    pub fn mpi_cmp_abs(X: *const mpi, Y: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_cmp_mpi"]
    pub fn mpi_cmp_mpi(X: *const mpi, Y: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_cmp_int"]
    pub fn mpi_cmp_int(X: *const mpi, z: mpi_sint) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_add_abs"]
    pub fn mpi_add_abs(X: *mut mpi, A: *const mpi, B: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_sub_abs"]
    pub fn mpi_sub_abs(X: *mut mpi, A: *const mpi, B: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_add_mpi"]
    pub fn mpi_add_mpi(X: *mut mpi, A: *const mpi, B: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_sub_mpi"]
    pub fn mpi_sub_mpi(X: *mut mpi, A: *const mpi, B: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_add_int"]
    pub fn mpi_add_int(X: *mut mpi, A: *const mpi, b: mpi_sint) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_sub_int"]
    pub fn mpi_sub_int(X: *mut mpi, A: *const mpi, b: mpi_sint) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_mul_mpi"]
    pub fn mpi_mul_mpi(X: *mut mpi, A: *const mpi, B: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_mul_int"]
    pub fn mpi_mul_int(X: *mut mpi, A: *const mpi, b: mpi_uint) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_div_mpi"]
    pub fn mpi_div_mpi(Q: *mut mpi, R: *mut mpi, A: *const mpi, B: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_div_int"]
    pub fn mpi_div_int(Q: *mut mpi, R: *mut mpi, A: *const mpi, b: mpi_sint) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_mod_mpi"]
    pub fn mpi_mod_mpi(R: *mut mpi, A: *const mpi, B: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_mod_int"]
    pub fn mpi_mod_int(r: *mut mpi_uint, A: *const mpi, b: mpi_sint) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_exp_mod"]
    pub fn mpi_exp_mod(
        X: *mut mpi,
        A: *const mpi,
        E: *const mpi,
        N: *const mpi,
        _RR: *mut mpi,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_fill_random"]
    pub fn mpi_fill_random(
        X: *mut mpi,
        size: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_gcd"]
    pub fn mpi_gcd(G: *mut mpi, A: *const mpi, B: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_inv_mod"]
    pub fn mpi_inv_mod(X: *mut mpi, A: *const mpi, N: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_is_prime"]
    pub fn mpi_is_prime(
        X: *const mpi,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_is_prime_ext"]
    pub fn mpi_is_prime_ext(
        X: *const mpi,
        rounds: raw_types::c_int,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
pub const MPI_GEN_PRIME_FLAG_DH: mpi_gen_prime_flag_t = 1;
pub const MPI_GEN_PRIME_FLAG_LOW_ERR: mpi_gen_prime_flag_t = 2;
pub type mpi_gen_prime_flag_t = u32;
extern "C" {
    #[link_name = "mbedtls_mpi_gen_prime"]
    pub fn mpi_gen_prime(
        X: *mut mpi,
        nbits: usize,
        flags: raw_types::c_int,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_mpi_self_test"]
    pub fn mpi_self_test(verbose: raw_types::c_int) -> raw_types::c_int;
}
pub const MD_NONE: md_type_t = 0;
pub const MD_MD2: md_type_t = 1;
pub const MD_MD4: md_type_t = 2;
pub const MD_MD5: md_type_t = 3;
pub const MD_SHA1: md_type_t = 4;
pub const MD_SHA224: md_type_t = 5;
pub const MD_SHA256: md_type_t = 6;
pub const MD_SHA384: md_type_t = 7;
pub const MD_SHA512: md_type_t = 8;
pub const MD_RIPEMD160: md_type_t = 9;
pub type md_type_t = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct md_context_t {
    pub md_info: *const md_info_t,
    pub md_ctx: *mut raw_types::c_void,
    pub hmac_ctx: *mut raw_types::c_void,
}
#[test]
fn bindgen_test_layout_md_context_t() {
    assert_eq!(
        ::core::mem::size_of::<md_context_t>(),
        24usize,
        concat!("Size of: ", stringify!(md_context_t))
    );
    assert_eq!(
        ::core::mem::align_of::<md_context_t>(),
        8usize,
        concat!("Alignment of ", stringify!(md_context_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<md_context_t>())).md_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(md_context_t),
            "::",
            stringify!(md_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<md_context_t>())).md_ctx as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(md_context_t),
            "::",
            stringify!(md_ctx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<md_context_t>())).hmac_ctx as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(md_context_t),
            "::",
            stringify!(hmac_ctx)
        )
    );
}
extern "C" {
    #[link_name = "mbedtls_md_list"]
    pub fn md_list() -> *const raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_info_from_string"]
    pub fn md_info_from_string(md_name: *const raw_types::c_char) -> *const md_info_t;
}
extern "C" {
    #[link_name = "mbedtls_md_info_from_type"]
    pub fn md_info_from_type(md_type: md_type_t) -> *const md_info_t;
}
extern "C" {
    #[link_name = "mbedtls_md_init"]
    pub fn md_init(ctx: *mut md_context_t);
}
extern "C" {
    #[link_name = "mbedtls_md_free"]
    pub fn md_free(ctx: *mut md_context_t);
}
extern "C" {
    #[link_name = "mbedtls_md_init_ctx"]
    pub fn md_init_ctx(ctx: *mut md_context_t, md_info: *const md_info_t) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_setup"]
    pub fn md_setup(
        ctx: *mut md_context_t,
        md_info: *const md_info_t,
        hmac: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_clone"]
    pub fn md_clone(dst: *mut md_context_t, src: *const md_context_t) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_get_size"]
    pub fn md_get_size(md_info: *const md_info_t) -> raw_types::c_uchar;
}
extern "C" {
    #[link_name = "mbedtls_md_get_type"]
    pub fn md_get_type(md_info: *const md_info_t) -> md_type_t;
}
extern "C" {
    #[link_name = "mbedtls_md_get_name"]
    pub fn md_get_name(md_info: *const md_info_t) -> *const raw_types::c_char;
}
extern "C" {
    #[link_name = "mbedtls_md_starts"]
    pub fn md_starts(ctx: *mut md_context_t) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_update"]
    pub fn md_update(
        ctx: *mut md_context_t,
        input: *const raw_types::c_uchar,
        ilen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_finish"]
    pub fn md_finish(ctx: *mut md_context_t, output: *mut raw_types::c_uchar) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md"]
    pub fn md(
        md_info: *const md_info_t,
        input: *const raw_types::c_uchar,
        ilen: usize,
        output: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_file"]
    pub fn md_file(
        md_info: *const md_info_t,
        path: *const raw_types::c_char,
        output: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_hmac_starts"]
    pub fn md_hmac_starts(
        ctx: *mut md_context_t,
        key: *const raw_types::c_uchar,
        keylen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_hmac_update"]
    pub fn md_hmac_update(
        ctx: *mut md_context_t,
        input: *const raw_types::c_uchar,
        ilen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_hmac_finish"]
    pub fn md_hmac_finish(
        ctx: *mut md_context_t,
        output: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_hmac_reset"]
    pub fn md_hmac_reset(ctx: *mut md_context_t) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_hmac"]
    pub fn md_hmac(
        md_info: *const md_info_t,
        key: *const raw_types::c_uchar,
        keylen: usize,
        input: *const raw_types::c_uchar,
        ilen: usize,
        output: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_md_process"]
    pub fn md_process(ctx: *mut md_context_t, data: *const raw_types::c_uchar) -> raw_types::c_int;
}
pub const P_ALL: idtype_t = 0;
pub const P_PID: idtype_t = 1;
pub const P_PGID: idtype_t = 2;
pub type idtype_t = u32;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = f64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct div_t {
    pub quot: raw_types::c_int,
    pub rem: raw_types::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::core::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::core::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ldiv_t {
    pub quot: raw_types::c_long,
    pub rem: raw_types::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lldiv_t {
    pub quot: raw_types::c_longlong,
    pub rem: raw_types::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const raw_types::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const raw_types::c_char) -> raw_types::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const raw_types::c_char) -> raw_types::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const raw_types::c_char) -> raw_types::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const raw_types::c_char, __endptr: *mut *mut raw_types::c_char) -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const raw_types::c_char, __endptr: *mut *mut raw_types::c_char) -> f32;
}
extern "C" {
    pub fn strtold(__nptr: *const raw_types::c_char, __endptr: *mut *mut raw_types::c_char) -> f64;
}
extern "C" {
    pub fn strtol(
        __nptr: *const raw_types::c_char,
        __endptr: *mut *mut raw_types::c_char,
        __base: raw_types::c_int,
    ) -> raw_types::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const raw_types::c_char,
        __endptr: *mut *mut raw_types::c_char,
        __base: raw_types::c_int,
    ) -> raw_types::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const raw_types::c_char,
        __endptr: *mut *mut raw_types::c_char,
        __base: raw_types::c_int,
    ) -> raw_types::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const raw_types::c_char,
        __endptr: *mut *mut raw_types::c_char,
        __base: raw_types::c_int,
    ) -> raw_types::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const raw_types::c_char,
        __endptr: *mut *mut raw_types::c_char,
        __base: raw_types::c_int,
    ) -> raw_types::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const raw_types::c_char,
        __endptr: *mut *mut raw_types::c_char,
        __base: raw_types::c_int,
    ) -> raw_types::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: raw_types::c_long) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn a64l(__s: *const raw_types::c_char) -> raw_types::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = raw_types::c_ulong;
pub type ushort = raw_types::c_ushort;
pub type uint = raw_types::c_uint;
pub type u_int8_t = raw_types::c_uchar;
pub type u_int16_t = raw_types::c_ushort;
pub type u_int32_t = raw_types::c_uint;
pub type u_int64_t = raw_types::c_ulong;
pub type register_t = raw_types::c_long;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sigset_t {
    pub __val: [raw_types::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::core::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::core::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::core::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::core::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::core::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = raw_types::c_long;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::core::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::core::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: raw_types::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: raw_types::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn gnu_dev_major(__dev: __dev_t) -> raw_types::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: __dev_t) -> raw_types::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(__major: raw_types::c_uint, __minor: raw_types::c_uint) -> __dev_t;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: raw_types::c_uint,
    pub __writers: raw_types::c_uint,
    pub __wrphase_futex: raw_types::c_uint,
    pub __writers_futex: raw_types::c_uint,
    pub __pad3: raw_types::c_uint,
    pub __pad4: raw_types::c_uint,
    pub __cur_writer: raw_types::c_int,
    pub __shared: raw_types::c_int,
    pub __rwelision: raw_types::c_schar,
    pub __pad1: [raw_types::c_uchar; 7usize],
    pub __pad2: raw_types::c_ulong,
    pub __flags: raw_types::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: raw_types::c_int,
    pub __count: raw_types::c_uint,
    pub __owner: raw_types::c_int,
    pub __nusers: raw_types::c_uint,
    pub __kind: raw_types::c_int,
    pub __spins: raw_types::c_short,
    pub __elision: raw_types::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [raw_types::c_uint; 2usize],
    pub __g_size: [raw_types::c_uint; 2usize],
    pub __g1_orig_size: raw_types::c_uint,
    pub __wrefs: raw_types::c_uint,
    pub __g_signals: [raw_types::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: raw_types::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: raw_types::c_uint,
    pub __high: raw_types::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: raw_types::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: raw_types::c_uint,
    pub __high: raw_types::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type pthread_t = raw_types::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [raw_types::c_char; 4usize],
    pub __align: raw_types::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [raw_types::c_char; 4usize],
    pub __align: raw_types::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = raw_types::c_uint;
pub type pthread_once_t = raw_types::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [raw_types::c_char; 56usize],
    pub __align: raw_types::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [raw_types::c_char; 40usize],
    pub __align: raw_types::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [raw_types::c_char; 48usize],
    pub __align: raw_types::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [raw_types::c_char; 56usize],
    pub __align: raw_types::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [raw_types::c_char; 8usize],
    pub __align: raw_types::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = raw_types::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [raw_types::c_char; 32usize],
    pub __align: raw_types::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [raw_types::c_char; 4usize],
    pub __align: raw_types::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> raw_types::c_long;
}
extern "C" {
    pub fn srandom(__seed: raw_types::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: raw_types::c_uint,
        __statebuf: *mut raw_types::c_char,
        __statelen: usize,
    ) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut raw_types::c_char) -> *mut raw_types::c_char;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: raw_types::c_int,
    pub rand_deg: raw_types::c_int,
    pub rand_sep: raw_types::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::core::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::core::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> raw_types::c_int;
}
extern "C" {
    pub fn srandom_r(__seed: raw_types::c_uint, __buf: *mut random_data) -> raw_types::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: raw_types::c_uint,
        __statebuf: *mut raw_types::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut raw_types::c_char,
        __buf: *mut random_data,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn rand() -> raw_types::c_int;
}
extern "C" {
    pub fn srand(__seed: raw_types::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut raw_types::c_uint) -> raw_types::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut raw_types::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> raw_types::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut raw_types::c_ushort) -> raw_types::c_long;
}
extern "C" {
    pub fn mrand48() -> raw_types::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut raw_types::c_ushort) -> raw_types::c_long;
}
extern "C" {
    pub fn srand48(__seedval: raw_types::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut raw_types::c_ushort) -> *mut raw_types::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut raw_types::c_ushort);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct drand48_data {
    pub __x: [raw_types::c_ushort; 3usize],
    pub __old_x: [raw_types::c_ushort; 3usize],
    pub __c: raw_types::c_ushort,
    pub __init: raw_types::c_ushort,
    pub __a: raw_types::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::core::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::core::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> raw_types::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut raw_types::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut raw_types::c_long,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut raw_types::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut raw_types::c_long,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut raw_types::c_long,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut raw_types::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut raw_types::c_long,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn srand48_r(__seedval: raw_types::c_long, __buffer: *mut drand48_data)
        -> raw_types::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut raw_types::c_ushort,
        __buffer: *mut drand48_data,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut raw_types::c_ushort,
        __buffer: *mut drand48_data,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn malloc(__size: usize) -> *mut raw_types::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: usize, __size: usize) -> *mut raw_types::c_void;
}
extern "C" {
    pub fn realloc(__ptr: *mut raw_types::c_void, __size: usize) -> *mut raw_types::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut raw_types::c_void);
}
extern "C" {
    pub fn alloca(__size: usize) -> *mut raw_types::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut raw_types::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut raw_types::c_void,
        __alignment: usize,
        __size: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: usize, __size: usize) -> *mut raw_types::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> raw_types::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::core::option::Option<
            unsafe extern "C" fn(__status: raw_types::c_int, __arg: *mut raw_types::c_void),
        >,
        __arg: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn exit(__status: raw_types::c_int);
}
extern "C" {
    pub fn quick_exit(__status: raw_types::c_int);
}
extern "C" {
    pub fn _Exit(__status: raw_types::c_int);
}
extern "C" {
    pub fn getenv(__name: *const raw_types::c_char) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut raw_types::c_char) -> raw_types::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const raw_types::c_char,
        __value: *const raw_types::c_char,
        __replace: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const raw_types::c_char) -> raw_types::c_int;
}
extern "C" {
    pub fn clearenv() -> raw_types::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut raw_types::c_char) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut raw_types::c_char) -> raw_types::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut raw_types::c_char,
        __suffixlen: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut raw_types::c_char) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn system(__command: *const raw_types::c_char) -> raw_types::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const raw_types::c_char,
        __resolved: *mut raw_types::c_char,
    ) -> *mut raw_types::c_char;
}
pub type __compar_fn_t = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const raw_types::c_void,
        arg2: *const raw_types::c_void,
    ) -> raw_types::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const raw_types::c_void,
        __base: *const raw_types::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut raw_types::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut raw_types::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn labs(__x: raw_types::c_long) -> raw_types::c_long;
}
extern "C" {
    pub fn llabs(__x: raw_types::c_longlong) -> raw_types::c_longlong;
}
extern "C" {
    pub fn div(__numer: raw_types::c_int, __denom: raw_types::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: raw_types::c_long, __denom: raw_types::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: raw_types::c_longlong, __denom: raw_types::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: raw_types::c_int,
        __decpt: *mut raw_types::c_int,
        __sign: *mut raw_types::c_int,
    ) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: raw_types::c_int,
        __decpt: *mut raw_types::c_int,
        __sign: *mut raw_types::c_int,
    ) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: raw_types::c_int,
        __buf: *mut raw_types::c_char,
    ) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: f64,
        __ndigit: raw_types::c_int,
        __decpt: *mut raw_types::c_int,
        __sign: *mut raw_types::c_int,
    ) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: f64,
        __ndigit: raw_types::c_int,
        __decpt: *mut raw_types::c_int,
        __sign: *mut raw_types::c_int,
    ) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: f64,
        __ndigit: raw_types::c_int,
        __buf: *mut raw_types::c_char,
    ) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: raw_types::c_int,
        __decpt: *mut raw_types::c_int,
        __sign: *mut raw_types::c_int,
        __buf: *mut raw_types::c_char,
        __len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: raw_types::c_int,
        __decpt: *mut raw_types::c_int,
        __sign: *mut raw_types::c_int,
        __buf: *mut raw_types::c_char,
        __len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: f64,
        __ndigit: raw_types::c_int,
        __decpt: *mut raw_types::c_int,
        __sign: *mut raw_types::c_int,
        __buf: *mut raw_types::c_char,
        __len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: f64,
        __ndigit: raw_types::c_int,
        __decpt: *mut raw_types::c_int,
        __sign: *mut raw_types::c_int,
        __buf: *mut raw_types::c_char,
        __len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn mblen(__s: *const raw_types::c_char, __n: usize) -> raw_types::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const raw_types::c_char,
        __n: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut raw_types::c_char, __wchar: wchar_t) -> raw_types::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const raw_types::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut raw_types::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const raw_types::c_char) -> raw_types::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut raw_types::c_char,
        __tokens: *const *mut raw_types::c_char,
        __valuep: *mut *mut raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: raw_types::c_int) -> raw_types::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sched_param {
    pub sched_priority: raw_types::c_int,
}
#[test]
fn bindgen_test_layout_sched_param() {
    assert_eq!(
        ::core::mem::size_of::<sched_param>(),
        4usize,
        concat!("Size of: ", stringify!(sched_param))
    );
    assert_eq!(
        ::core::mem::align_of::<sched_param>(),
        4usize,
        concat!("Alignment of ", stringify!(sched_param))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sched_param>())).sched_priority as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sched_param),
            "::",
            stringify!(sched_priority)
        )
    );
}
pub type __cpu_mask = raw_types::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 16usize],
}
#[test]
fn bindgen_test_layout_cpu_set_t() {
    assert_eq!(
        ::core::mem::size_of::<cpu_set_t>(),
        128usize,
        concat!("Size of: ", stringify!(cpu_set_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cpu_set_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_set_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cpu_set_t>())).__bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_set_t),
            "::",
            stringify!(__bits)
        )
    );
}
extern "C" {
    pub fn __sched_cpucount(__setsize: usize, __setp: *const cpu_set_t) -> raw_types::c_int;
}
extern "C" {
    pub fn __sched_cpualloc(__count: usize) -> *mut cpu_set_t;
}
extern "C" {
    pub fn __sched_cpufree(__set: *mut cpu_set_t);
}
extern "C" {
    pub fn sched_setparam(__pid: __pid_t, __param: *const sched_param) -> raw_types::c_int;
}
extern "C" {
    pub fn sched_getparam(__pid: __pid_t, __param: *mut sched_param) -> raw_types::c_int;
}
extern "C" {
    pub fn sched_setscheduler(
        __pid: __pid_t,
        __policy: raw_types::c_int,
        __param: *const sched_param,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn sched_getscheduler(__pid: __pid_t) -> raw_types::c_int;
}
extern "C" {
    pub fn sched_yield() -> raw_types::c_int;
}
extern "C" {
    pub fn sched_get_priority_max(__algorithm: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn sched_get_priority_min(__algorithm: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn sched_rr_get_interval(__pid: __pid_t, __t: *mut timespec) -> raw_types::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm {
    pub tm_sec: raw_types::c_int,
    pub tm_min: raw_types::c_int,
    pub tm_hour: raw_types::c_int,
    pub tm_mday: raw_types::c_int,
    pub tm_mon: raw_types::c_int,
    pub tm_year: raw_types::c_int,
    pub tm_wday: raw_types::c_int,
    pub tm_yday: raw_types::c_int,
    pub tm_isdst: raw_types::c_int,
    pub tm_gmtoff: raw_types::c_long,
    pub tm_zone: *const raw_types::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::core::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::core::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_gmtoff as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_zone as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(
        ::core::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::core::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<itimerspec>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<itimerspec>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const raw_types::c_ushort,
    pub __ctype_tolower: *const raw_types::c_int,
    pub __ctype_toupper: *const raw_types::c_int,
    pub __names: [*const raw_types::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::core::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::core::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut raw_types::c_char,
        __maxsize: usize,
        __format: *const raw_types::c_char,
        __tp: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn strftime_l(
        __s: *mut raw_types::c_char,
        __maxsize: usize,
        __format: *const raw_types::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn asctime_r(__tp: *const tm, __buf: *mut raw_types::c_char) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn ctime_r(__timer: *const time_t, __buf: *mut raw_types::c_char)
        -> *mut raw_types::c_char;
}
extern "C" {
    #[link_name = "__tzname"]
    pub static mut __tzname: [*mut raw_types::c_char; 2usize];
}
extern "C" {
    #[link_name = "__daylight"]
    pub static mut __daylight: raw_types::c_int;
}
extern "C" {
    #[link_name = "__timezone"]
    pub static mut __timezone: raw_types::c_long;
}
extern "C" {
    #[link_name = "tzname"]
    pub static mut tzname: [*mut raw_types::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    #[link_name = "daylight"]
    pub static mut daylight: raw_types::c_int;
}
extern "C" {
    #[link_name = "timezone"]
    pub static mut timezone: raw_types::c_long;
}
extern "C" {
    pub fn stime(__when: *const time_t) -> raw_types::c_int;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> raw_types::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> raw_types::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> raw_types::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: raw_types::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> raw_types::c_int;
}
extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> raw_types::c_int;
}
extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: raw_types::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> raw_types::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> raw_types::c_int;
}
extern "C" {
    pub fn timespec_get(__ts: *mut timespec, __base: raw_types::c_int) -> raw_types::c_int;
}
pub type __jmp_buf = [raw_types::c_long; 8usize];
pub const PTHREAD_CREATE_JOINABLE: _bindgen_ty_1 = 0;
pub const PTHREAD_CREATE_DETACHED: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = u32;
pub const PTHREAD_MUTEX_TIMED_NP: _bindgen_ty_2 = 0;
pub const PTHREAD_MUTEX_RECURSIVE_NP: _bindgen_ty_2 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK_NP: _bindgen_ty_2 = 2;
pub const PTHREAD_MUTEX_ADAPTIVE_NP: _bindgen_ty_2 = 3;
pub const PTHREAD_MUTEX_NORMAL: _bindgen_ty_2 = 0;
pub const PTHREAD_MUTEX_RECURSIVE: _bindgen_ty_2 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK: _bindgen_ty_2 = 2;
pub const PTHREAD_MUTEX_DEFAULT: _bindgen_ty_2 = 0;
pub type _bindgen_ty_2 = u32;
pub const PTHREAD_MUTEX_STALLED: _bindgen_ty_3 = 0;
pub const PTHREAD_MUTEX_STALLED_NP: _bindgen_ty_3 = 0;
pub const PTHREAD_MUTEX_ROBUST: _bindgen_ty_3 = 1;
pub const PTHREAD_MUTEX_ROBUST_NP: _bindgen_ty_3 = 1;
pub type _bindgen_ty_3 = u32;
pub const PTHREAD_PRIO_NONE: _bindgen_ty_4 = 0;
pub const PTHREAD_PRIO_INHERIT: _bindgen_ty_4 = 1;
pub const PTHREAD_PRIO_PROTECT: _bindgen_ty_4 = 2;
pub type _bindgen_ty_4 = u32;
pub const PTHREAD_RWLOCK_PREFER_READER_NP: _bindgen_ty_5 = 0;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NP: _bindgen_ty_5 = 1;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP: _bindgen_ty_5 = 2;
pub const PTHREAD_RWLOCK_DEFAULT_NP: _bindgen_ty_5 = 0;
pub type _bindgen_ty_5 = u32;
pub const PTHREAD_INHERIT_SCHED: _bindgen_ty_6 = 0;
pub const PTHREAD_EXPLICIT_SCHED: _bindgen_ty_6 = 1;
pub type _bindgen_ty_6 = u32;
pub const PTHREAD_SCOPE_SYSTEM: _bindgen_ty_7 = 0;
pub const PTHREAD_SCOPE_PROCESS: _bindgen_ty_7 = 1;
pub type _bindgen_ty_7 = u32;
pub const PTHREAD_PROCESS_PRIVATE: _bindgen_ty_8 = 0;
pub const PTHREAD_PROCESS_SHARED: _bindgen_ty_8 = 1;
pub type _bindgen_ty_8 = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _pthread_cleanup_buffer {
    pub __routine: ::core::option::Option<unsafe extern "C" fn(arg1: *mut raw_types::c_void)>,
    pub __arg: *mut raw_types::c_void,
    pub __canceltype: raw_types::c_int,
    pub __prev: *mut _pthread_cleanup_buffer,
}
#[test]
fn bindgen_test_layout__pthread_cleanup_buffer() {
    assert_eq!(
        ::core::mem::size_of::<_pthread_cleanup_buffer>(),
        32usize,
        concat!("Size of: ", stringify!(_pthread_cleanup_buffer))
    );
    assert_eq!(
        ::core::mem::align_of::<_pthread_cleanup_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(_pthread_cleanup_buffer))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_pthread_cleanup_buffer>())).__routine as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_pthread_cleanup_buffer>())).__arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_pthread_cleanup_buffer>())).__canceltype as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__canceltype)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_pthread_cleanup_buffer>())).__prev as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__prev)
        )
    );
}
pub const PTHREAD_CANCEL_ENABLE: _bindgen_ty_9 = 0;
pub const PTHREAD_CANCEL_DISABLE: _bindgen_ty_9 = 1;
pub type _bindgen_ty_9 = u32;
pub const PTHREAD_CANCEL_DEFERRED: _bindgen_ty_10 = 0;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: _bindgen_ty_10 = 1;
pub type _bindgen_ty_10 = u32;
extern "C" {
    pub fn pthread_create(
        __newthread: *mut pthread_t,
        __attr: *const pthread_attr_t,
        __start_routine: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut raw_types::c_void) -> *mut raw_types::c_void,
        >,
        __arg: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_exit(__retval: *mut raw_types::c_void);
}
extern "C" {
    pub fn pthread_join(
        __th: pthread_t,
        __thread_return: *mut *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_detach(__th: pthread_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_self() -> pthread_t;
}
extern "C" {
    pub fn pthread_equal(__thread1: pthread_t, __thread2: pthread_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_init(__attr: *mut pthread_attr_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_destroy(__attr: *mut pthread_attr_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_getdetachstate(
        __attr: *const pthread_attr_t,
        __detachstate: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_setdetachstate(
        __attr: *mut pthread_attr_t,
        __detachstate: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_getguardsize(
        __attr: *const pthread_attr_t,
        __guardsize: *mut usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_setguardsize(
        __attr: *mut pthread_attr_t,
        __guardsize: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedparam(
        __attr: *const pthread_attr_t,
        __param: *mut sched_param,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedparam(
        __attr: *mut pthread_attr_t,
        __param: *const sched_param,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedpolicy(
        __attr: *const pthread_attr_t,
        __policy: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedpolicy(
        __attr: *mut pthread_attr_t,
        __policy: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_getinheritsched(
        __attr: *const pthread_attr_t,
        __inherit: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_setinheritsched(
        __attr: *mut pthread_attr_t,
        __inherit: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_getscope(
        __attr: *const pthread_attr_t,
        __scope: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_setscope(
        __attr: *mut pthread_attr_t,
        __scope: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_getstackaddr(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_setstackaddr(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_getstacksize(
        __attr: *const pthread_attr_t,
        __stacksize: *mut usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_setstacksize(
        __attr: *mut pthread_attr_t,
        __stacksize: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_getstack(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut raw_types::c_void,
        __stacksize: *mut usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_attr_setstack(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut raw_types::c_void,
        __stacksize: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_setschedparam(
        __target_thread: pthread_t,
        __policy: raw_types::c_int,
        __param: *const sched_param,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_getschedparam(
        __target_thread: pthread_t,
        __policy: *mut raw_types::c_int,
        __param: *mut sched_param,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_setschedprio(
        __target_thread: pthread_t,
        __prio: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_once(
        __once_control: *mut pthread_once_t,
        __init_routine: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_setcancelstate(
        __state: raw_types::c_int,
        __oldstate: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_setcanceltype(
        __type: raw_types::c_int,
        __oldtype: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_cancel(__th: pthread_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_testcancel();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_unwind_buf_t {
    pub __cancel_jmp_buf: [__pthread_unwind_buf_t__bindgen_ty_1; 1usize],
    pub __pad: [*mut raw_types::c_void; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_unwind_buf_t__bindgen_ty_1 {
    pub __cancel_jmp_buf: __jmp_buf,
    pub __mask_was_saved: raw_types::c_int,
}
#[test]
fn bindgen_test_layout___pthread_unwind_buf_t__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_unwind_buf_t__bindgen_ty_1>(),
        72usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_unwind_buf_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_unwind_buf_t__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_unwind_buf_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_unwind_buf_t__bindgen_ty_1>())).__cancel_jmp_buf
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t__bindgen_ty_1),
            "::",
            stringify!(__cancel_jmp_buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_unwind_buf_t__bindgen_ty_1>())).__mask_was_saved
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t__bindgen_ty_1),
            "::",
            stringify!(__mask_was_saved)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_unwind_buf_t() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_unwind_buf_t>(),
        104usize,
        concat!("Size of: ", stringify!(__pthread_unwind_buf_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_unwind_buf_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_unwind_buf_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_unwind_buf_t>())).__cancel_jmp_buf as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t),
            "::",
            stringify!(__cancel_jmp_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_unwind_buf_t>())).__pad as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t),
            "::",
            stringify!(__pad)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cleanup_frame {
    pub __cancel_routine:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut raw_types::c_void)>,
    pub __cancel_arg: *mut raw_types::c_void,
    pub __do_it: raw_types::c_int,
    pub __cancel_type: raw_types::c_int,
}
#[test]
fn bindgen_test_layout___pthread_cleanup_frame() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cleanup_frame>(),
        24usize,
        concat!("Size of: ", stringify!(__pthread_cleanup_frame))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cleanup_frame>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cleanup_frame))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cleanup_frame>())).__cancel_routine as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_routine)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cleanup_frame>())).__cancel_arg as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_arg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cleanup_frame>())).__do_it as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__do_it)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cleanup_frame>())).__cancel_type as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_type)
        )
    );
}
extern "C" {
    pub fn __pthread_register_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unregister_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unwind_next(__buf: *mut __pthread_unwind_buf_t);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __jmp_buf_tag {
    _unused: [u8; 0],
}
extern "C" {
    pub fn __sigsetjmp(__env: *mut __jmp_buf_tag, __savemask: raw_types::c_int)
        -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutex_init(
        __mutex: *mut pthread_mutex_t,
        __mutexattr: *const pthread_mutexattr_t,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutex_destroy(__mutex: *mut pthread_mutex_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutex_trylock(__mutex: *mut pthread_mutex_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutex_lock(__mutex: *mut pthread_mutex_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutex_timedlock(
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutex_unlock(__mutex: *mut pthread_mutex_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutex_getprioceiling(
        __mutex: *const pthread_mutex_t,
        __prioceiling: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutex_setprioceiling(
        __mutex: *mut pthread_mutex_t,
        __prioceiling: raw_types::c_int,
        __old_ceiling: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutex_consistent(__mutex: *mut pthread_mutex_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_init(__attr: *mut pthread_mutexattr_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_destroy(__attr: *mut pthread_mutexattr_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getpshared(
        __attr: *const pthread_mutexattr_t,
        __pshared: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setpshared(
        __attr: *mut pthread_mutexattr_t,
        __pshared: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_gettype(
        __attr: *const pthread_mutexattr_t,
        __kind: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_settype(
        __attr: *mut pthread_mutexattr_t,
        __kind: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getprotocol(
        __attr: *const pthread_mutexattr_t,
        __protocol: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setprotocol(
        __attr: *mut pthread_mutexattr_t,
        __protocol: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getprioceiling(
        __attr: *const pthread_mutexattr_t,
        __prioceiling: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setprioceiling(
        __attr: *mut pthread_mutexattr_t,
        __prioceiling: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getrobust(
        __attr: *const pthread_mutexattr_t,
        __robustness: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setrobust(
        __attr: *mut pthread_mutexattr_t,
        __robustness: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlock_init(
        __rwlock: *mut pthread_rwlock_t,
        __attr: *const pthread_rwlockattr_t,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlock_destroy(__rwlock: *mut pthread_rwlock_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlock_rdlock(__rwlock: *mut pthread_rwlock_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlock_tryrdlock(__rwlock: *mut pthread_rwlock_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlock_timedrdlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlock_wrlock(__rwlock: *mut pthread_rwlock_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlock_trywrlock(__rwlock: *mut pthread_rwlock_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlock_timedwrlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlock_unlock(__rwlock: *mut pthread_rwlock_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_init(__attr: *mut pthread_rwlockattr_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_destroy(__attr: *mut pthread_rwlockattr_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_getpshared(
        __attr: *const pthread_rwlockattr_t,
        __pshared: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_setpshared(
        __attr: *mut pthread_rwlockattr_t,
        __pshared: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_getkind_np(
        __attr: *const pthread_rwlockattr_t,
        __pref: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_setkind_np(
        __attr: *mut pthread_rwlockattr_t,
        __pref: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_cond_init(
        __cond: *mut pthread_cond_t,
        __cond_attr: *const pthread_condattr_t,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_cond_destroy(__cond: *mut pthread_cond_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_cond_signal(__cond: *mut pthread_cond_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_cond_broadcast(__cond: *mut pthread_cond_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_cond_wait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_cond_timedwait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_condattr_init(__attr: *mut pthread_condattr_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_condattr_destroy(__attr: *mut pthread_condattr_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_condattr_getpshared(
        __attr: *const pthread_condattr_t,
        __pshared: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_condattr_setpshared(
        __attr: *mut pthread_condattr_t,
        __pshared: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_condattr_getclock(
        __attr: *const pthread_condattr_t,
        __clock_id: *mut __clockid_t,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_condattr_setclock(
        __attr: *mut pthread_condattr_t,
        __clock_id: __clockid_t,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_spin_init(
        __lock: *mut pthread_spinlock_t,
        __pshared: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_spin_destroy(__lock: *mut pthread_spinlock_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_spin_lock(__lock: *mut pthread_spinlock_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_spin_trylock(__lock: *mut pthread_spinlock_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_spin_unlock(__lock: *mut pthread_spinlock_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_barrier_init(
        __barrier: *mut pthread_barrier_t,
        __attr: *const pthread_barrierattr_t,
        __count: raw_types::c_uint,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_barrier_destroy(__barrier: *mut pthread_barrier_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_barrier_wait(__barrier: *mut pthread_barrier_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_init(__attr: *mut pthread_barrierattr_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_destroy(__attr: *mut pthread_barrierattr_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_getpshared(
        __attr: *const pthread_barrierattr_t,
        __pshared: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_setpshared(
        __attr: *mut pthread_barrierattr_t,
        __pshared: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_key_create(
        __key: *mut pthread_key_t,
        __destr_function: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut raw_types::c_void),
        >,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_key_delete(__key: pthread_key_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_getspecific(__key: pthread_key_t) -> *mut raw_types::c_void;
}
extern "C" {
    pub fn pthread_setspecific(
        __key: pthread_key_t,
        __pointer: *const raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_getcpuclockid(
        __thread_id: pthread_t,
        __clock_id: *mut __clockid_t,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn pthread_atfork(
        __prepare: ::core::option::Option<unsafe extern "C" fn()>,
        __parent: ::core::option::Option<unsafe extern "C" fn()>,
        __child: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> raw_types::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct threading_mutex_t {
    pub mutex: pthread_mutex_t,
    pub is_valid: raw_types::c_char,
}
#[test]
fn bindgen_test_layout_threading_mutex_t() {
    assert_eq!(
        ::core::mem::size_of::<threading_mutex_t>(),
        48usize,
        concat!("Size of: ", stringify!(threading_mutex_t))
    );
    assert_eq!(
        ::core::mem::align_of::<threading_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(threading_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<threading_mutex_t>())).mutex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(threading_mutex_t),
            "::",
            stringify!(mutex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<threading_mutex_t>())).is_valid as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(threading_mutex_t),
            "::",
            stringify!(is_valid)
        )
    );
}
extern "C" {
    #[link_name = "mbedtls_mutex_init"]
    pub static mut mutex_init:
        ::core::option::Option<unsafe extern "C" fn(mutex: *mut threading_mutex_t)>;
}
extern "C" {
    #[link_name = "mbedtls_mutex_free"]
    pub static mut mutex_free:
        ::core::option::Option<unsafe extern "C" fn(mutex: *mut threading_mutex_t)>;
}
extern "C" {
    #[link_name = "mbedtls_mutex_lock"]
    pub static mut mutex_lock: ::core::option::Option<
        unsafe extern "C" fn(mutex: *mut threading_mutex_t) -> raw_types::c_int,
    >;
}
extern "C" {
    #[link_name = "mbedtls_mutex_unlock"]
    pub static mut mutex_unlock: ::core::option::Option<
        unsafe extern "C" fn(mutex: *mut threading_mutex_t) -> raw_types::c_int,
    >;
}
extern "C" {
    #[link_name = "mbedtls_mutex_trylock"]
    pub static mut mutex_trylock: ::core::option::Option<
        unsafe extern "C" fn(mutex: *mut threading_mutex_t) -> raw_types::c_int,
    >;
}
extern "C" {
    #[link_name = "mbedtls_threading_readdir_mutex"]
    pub static mut threading_readdir_mutex: threading_mutex_t;
}
extern "C" {
    #[link_name = "mbedtls_threading_gmtime_mutex"]
    pub static mut threading_gmtime_mutex: threading_mutex_t;
}
extern "C" {
    #[link_name = "mbedtls_threading_trylock"]
    pub static mut threading_trylock: raw_types::c_int;
}
pub const ECP_DP_NONE: ecp_group_id = 0;
pub const ECP_DP_SECP192R1: ecp_group_id = 1;
pub const ECP_DP_SECP224R1: ecp_group_id = 2;
pub const ECP_DP_SECP256R1: ecp_group_id = 3;
pub const ECP_DP_SECP384R1: ecp_group_id = 4;
pub const ECP_DP_SECP521R1: ecp_group_id = 5;
pub const ECP_DP_BP256R1: ecp_group_id = 6;
pub const ECP_DP_BP384R1: ecp_group_id = 7;
pub const ECP_DP_BP512R1: ecp_group_id = 8;
pub const ECP_DP_CURVE25519: ecp_group_id = 9;
pub const ECP_DP_SECP192K1: ecp_group_id = 10;
pub const ECP_DP_SECP224K1: ecp_group_id = 11;
pub const ECP_DP_SECP256K1: ecp_group_id = 12;
pub const ECP_DP_CURVE448: ecp_group_id = 13;
pub type ecp_group_id = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ecp_curve_info {
    pub grp_id: ecp_group_id,
    pub tls_id: u16,
    pub bit_size: u16,
    pub name: *const raw_types::c_char,
}
#[test]
fn bindgen_test_layout_ecp_curve_info() {
    assert_eq!(
        ::core::mem::size_of::<ecp_curve_info>(),
        16usize,
        concat!("Size of: ", stringify!(ecp_curve_info))
    );
    assert_eq!(
        ::core::mem::align_of::<ecp_curve_info>(),
        8usize,
        concat!("Alignment of ", stringify!(ecp_curve_info))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_curve_info>())).grp_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_curve_info),
            "::",
            stringify!(grp_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_curve_info>())).tls_id as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_curve_info),
            "::",
            stringify!(tls_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_curve_info>())).bit_size as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_curve_info),
            "::",
            stringify!(bit_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_curve_info>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_curve_info),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ecp_point {
    pub X: mpi,
    pub Y: mpi,
    pub Z: mpi,
}
#[test]
fn bindgen_test_layout_ecp_point() {
    assert_eq!(
        ::core::mem::size_of::<ecp_point>(),
        72usize,
        concat!("Size of: ", stringify!(ecp_point))
    );
    assert_eq!(
        ::core::mem::align_of::<ecp_point>(),
        8usize,
        concat!("Alignment of ", stringify!(ecp_point))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_point>())).X as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_point),
            "::",
            stringify!(X)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_point>())).Y as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_point),
            "::",
            stringify!(Y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_point>())).Z as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_point),
            "::",
            stringify!(Z)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ecp_group {
    pub id: ecp_group_id,
    pub P: mpi,
    pub A: mpi,
    pub B: mpi,
    pub G: ecp_point,
    pub N: mpi,
    pub pbits: usize,
    pub nbits: usize,
    pub h: raw_types::c_uint,
    pub modp: ::core::option::Option<unsafe extern "C" fn(arg1: *mut mpi) -> raw_types::c_int>,
    pub t_pre: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ecp_point,
            arg2: *mut raw_types::c_void,
        ) -> raw_types::c_int,
    >,
    pub t_post: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ecp_point,
            arg2: *mut raw_types::c_void,
        ) -> raw_types::c_int,
    >,
    pub t_data: *mut raw_types::c_void,
    pub T: *mut ecp_point,
    pub T_size: usize,
}
#[test]
fn bindgen_test_layout_ecp_group() {
    assert_eq!(
        ::core::mem::size_of::<ecp_group>(),
        248usize,
        concat!("Size of: ", stringify!(ecp_group))
    );
    assert_eq!(
        ::core::mem::align_of::<ecp_group>(),
        8usize,
        concat!("Alignment of ", stringify!(ecp_group))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).P as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(P)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).A as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(A)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).B as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(B)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).G as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(G)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).N as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).pbits as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(pbits)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).nbits as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(nbits)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).h as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).modp as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(modp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).t_pre as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(t_pre)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).t_post as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(t_post)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).t_data as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(t_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).T as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(T)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).T_size as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(T_size)
        )
    );
}
pub type ecp_restart_ctx = raw_types::c_void;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ecp_keypair {
    pub grp: ecp_group,
    pub d: mpi,
    pub Q: ecp_point,
}
#[test]
fn bindgen_test_layout_ecp_keypair() {
    assert_eq!(
        ::core::mem::size_of::<ecp_keypair>(),
        344usize,
        concat!("Size of: ", stringify!(ecp_keypair))
    );
    assert_eq!(
        ::core::mem::align_of::<ecp_keypair>(),
        8usize,
        concat!("Alignment of ", stringify!(ecp_keypair))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_keypair>())).grp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_keypair),
            "::",
            stringify!(grp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_keypair>())).d as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_keypair),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_keypair>())).Q as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_keypair),
            "::",
            stringify!(Q)
        )
    );
}
extern "C" {
    #[link_name = "mbedtls_ecp_curve_list"]
    pub fn ecp_curve_list() -> *const ecp_curve_info;
}
extern "C" {
    #[link_name = "mbedtls_ecp_grp_id_list"]
    pub fn ecp_grp_id_list() -> *const ecp_group_id;
}
extern "C" {
    #[link_name = "mbedtls_ecp_curve_info_from_grp_id"]
    pub fn ecp_curve_info_from_grp_id(grp_id: ecp_group_id) -> *const ecp_curve_info;
}
extern "C" {
    #[link_name = "mbedtls_ecp_curve_info_from_tls_id"]
    pub fn ecp_curve_info_from_tls_id(tls_id: u16) -> *const ecp_curve_info;
}
extern "C" {
    #[link_name = "mbedtls_ecp_curve_info_from_name"]
    pub fn ecp_curve_info_from_name(name: *const raw_types::c_char) -> *const ecp_curve_info;
}
extern "C" {
    #[link_name = "mbedtls_ecp_point_init"]
    pub fn ecp_point_init(pt: *mut ecp_point);
}
extern "C" {
    #[link_name = "mbedtls_ecp_group_init"]
    pub fn ecp_group_init(grp: *mut ecp_group);
}
extern "C" {
    #[link_name = "mbedtls_ecp_keypair_init"]
    pub fn ecp_keypair_init(key: *mut ecp_keypair);
}
extern "C" {
    #[link_name = "mbedtls_ecp_point_free"]
    pub fn ecp_point_free(pt: *mut ecp_point);
}
extern "C" {
    #[link_name = "mbedtls_ecp_group_free"]
    pub fn ecp_group_free(grp: *mut ecp_group);
}
extern "C" {
    #[link_name = "mbedtls_ecp_keypair_free"]
    pub fn ecp_keypair_free(key: *mut ecp_keypair);
}
extern "C" {
    #[link_name = "mbedtls_ecp_copy"]
    pub fn ecp_copy(P: *mut ecp_point, Q: *const ecp_point) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_group_copy"]
    pub fn ecp_group_copy(dst: *mut ecp_group, src: *const ecp_group) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_set_zero"]
    pub fn ecp_set_zero(pt: *mut ecp_point) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_is_zero"]
    pub fn ecp_is_zero(pt: *mut ecp_point) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_point_cmp"]
    pub fn ecp_point_cmp(P: *const ecp_point, Q: *const ecp_point) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_point_read_string"]
    pub fn ecp_point_read_string(
        P: *mut ecp_point,
        radix: raw_types::c_int,
        x: *const raw_types::c_char,
        y: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_point_write_binary"]
    pub fn ecp_point_write_binary(
        grp: *const ecp_group,
        P: *const ecp_point,
        format: raw_types::c_int,
        olen: *mut usize,
        buf: *mut raw_types::c_uchar,
        buflen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_point_read_binary"]
    pub fn ecp_point_read_binary(
        grp: *const ecp_group,
        P: *mut ecp_point,
        buf: *const raw_types::c_uchar,
        ilen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_tls_read_point"]
    pub fn ecp_tls_read_point(
        grp: *const ecp_group,
        pt: *mut ecp_point,
        buf: *mut *const raw_types::c_uchar,
        len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_tls_write_point"]
    pub fn ecp_tls_write_point(
        grp: *const ecp_group,
        pt: *const ecp_point,
        format: raw_types::c_int,
        olen: *mut usize,
        buf: *mut raw_types::c_uchar,
        blen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_group_load"]
    pub fn ecp_group_load(grp: *mut ecp_group, id: ecp_group_id) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_tls_read_group"]
    pub fn ecp_tls_read_group(
        grp: *mut ecp_group,
        buf: *mut *const raw_types::c_uchar,
        len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_tls_read_group_id"]
    pub fn ecp_tls_read_group_id(
        grp: *mut ecp_group_id,
        buf: *mut *const raw_types::c_uchar,
        len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_tls_write_group"]
    pub fn ecp_tls_write_group(
        grp: *const ecp_group,
        olen: *mut usize,
        buf: *mut raw_types::c_uchar,
        blen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_mul"]
    pub fn ecp_mul(
        grp: *mut ecp_group,
        R: *mut ecp_point,
        m: *const mpi,
        P: *const ecp_point,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_mul_restartable"]
    pub fn ecp_mul_restartable(
        grp: *mut ecp_group,
        R: *mut ecp_point,
        m: *const mpi,
        P: *const ecp_point,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        rs_ctx: *mut ecp_restart_ctx,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_muladd"]
    pub fn ecp_muladd(
        grp: *mut ecp_group,
        R: *mut ecp_point,
        m: *const mpi,
        P: *const ecp_point,
        n: *const mpi,
        Q: *const ecp_point,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_muladd_restartable"]
    pub fn ecp_muladd_restartable(
        grp: *mut ecp_group,
        R: *mut ecp_point,
        m: *const mpi,
        P: *const ecp_point,
        n: *const mpi,
        Q: *const ecp_point,
        rs_ctx: *mut ecp_restart_ctx,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_check_pubkey"]
    pub fn ecp_check_pubkey(grp: *const ecp_group, pt: *const ecp_point) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_check_privkey"]
    pub fn ecp_check_privkey(grp: *const ecp_group, d: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_gen_privkey"]
    pub fn ecp_gen_privkey(
        grp: *const ecp_group,
        d: *mut mpi,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_gen_keypair_base"]
    pub fn ecp_gen_keypair_base(
        grp: *mut ecp_group,
        G: *const ecp_point,
        d: *mut mpi,
        Q: *mut ecp_point,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_gen_keypair"]
    pub fn ecp_gen_keypair(
        grp: *mut ecp_group,
        d: *mut mpi,
        Q: *mut ecp_point,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_gen_key"]
    pub fn ecp_gen_key(
        grp_id: ecp_group_id,
        key: *mut ecp_keypair,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_check_pub_priv"]
    pub fn ecp_check_pub_priv(
        pub_: *const ecp_keypair,
        prv: *const ecp_keypair,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecp_self_test"]
    pub fn ecp_self_test(verbose: raw_types::c_int) -> raw_types::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rsa_context {
    pub ver: raw_types::c_int,
    pub len: usize,
    pub N: mpi,
    pub E: mpi,
    pub D: mpi,
    pub P: mpi,
    pub Q: mpi,
    pub DP: mpi,
    pub DQ: mpi,
    pub QP: mpi,
    pub RN: mpi,
    pub RP: mpi,
    pub RQ: mpi,
    pub Vi: mpi,
    pub Vf: mpi,
    pub padding: raw_types::c_int,
    pub hash_id: raw_types::c_int,
    pub mutex: threading_mutex_t,
}
#[test]
fn bindgen_test_layout_rsa_context() {
    assert_eq!(
        ::core::mem::size_of::<rsa_context>(),
        384usize,
        concat!("Size of: ", stringify!(rsa_context))
    );
    assert_eq!(
        ::core::mem::align_of::<rsa_context>(),
        8usize,
        concat!("Alignment of ", stringify!(rsa_context))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).ver as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(ver)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).N as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).E as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(E)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).D as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(D)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).P as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(P)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).Q as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(Q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).DP as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(DP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).DQ as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(DQ)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).QP as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(QP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).RN as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(RN)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).RP as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(RP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).RQ as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(RQ)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).Vi as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(Vi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).Vf as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(Vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).padding as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).hash_id as *const _ as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(hash_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).mutex as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(mutex)
        )
    );
}
extern "C" {
    #[link_name = "mbedtls_rsa_init"]
    pub fn rsa_init(ctx: *mut rsa_context, padding: raw_types::c_int, hash_id: raw_types::c_int);
}
extern "C" {
    #[link_name = "mbedtls_rsa_import"]
    pub fn rsa_import(
        ctx: *mut rsa_context,
        N: *const mpi,
        P: *const mpi,
        Q: *const mpi,
        D: *const mpi,
        E: *const mpi,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_import_raw"]
    pub fn rsa_import_raw(
        ctx: *mut rsa_context,
        N: *const raw_types::c_uchar,
        N_len: usize,
        P: *const raw_types::c_uchar,
        P_len: usize,
        Q: *const raw_types::c_uchar,
        Q_len: usize,
        D: *const raw_types::c_uchar,
        D_len: usize,
        E: *const raw_types::c_uchar,
        E_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_complete"]
    pub fn rsa_complete(ctx: *mut rsa_context) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_export"]
    pub fn rsa_export(
        ctx: *const rsa_context,
        N: *mut mpi,
        P: *mut mpi,
        Q: *mut mpi,
        D: *mut mpi,
        E: *mut mpi,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_export_raw"]
    pub fn rsa_export_raw(
        ctx: *const rsa_context,
        N: *mut raw_types::c_uchar,
        N_len: usize,
        P: *mut raw_types::c_uchar,
        P_len: usize,
        Q: *mut raw_types::c_uchar,
        Q_len: usize,
        D: *mut raw_types::c_uchar,
        D_len: usize,
        E: *mut raw_types::c_uchar,
        E_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_export_crt"]
    pub fn rsa_export_crt(
        ctx: *const rsa_context,
        DP: *mut mpi,
        DQ: *mut mpi,
        QP: *mut mpi,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_set_padding"]
    pub fn rsa_set_padding(
        ctx: *mut rsa_context,
        padding: raw_types::c_int,
        hash_id: raw_types::c_int,
    );
}
extern "C" {
    #[link_name = "mbedtls_rsa_get_len"]
    pub fn rsa_get_len(ctx: *const rsa_context) -> usize;
}
extern "C" {
    #[link_name = "mbedtls_rsa_gen_key"]
    pub fn rsa_gen_key(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        nbits: raw_types::c_uint,
        exponent: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_check_pubkey"]
    pub fn rsa_check_pubkey(ctx: *const rsa_context) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_check_privkey"]
    pub fn rsa_check_privkey(ctx: *const rsa_context) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_check_pub_priv"]
    pub fn rsa_check_pub_priv(
        pub_: *const rsa_context,
        prv: *const rsa_context,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_public"]
    pub fn rsa_public(
        ctx: *mut rsa_context,
        input: *const raw_types::c_uchar,
        output: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_private"]
    pub fn rsa_private(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        input: *const raw_types::c_uchar,
        output: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_pkcs1_encrypt"]
    pub fn rsa_pkcs1_encrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        ilen: usize,
        input: *const raw_types::c_uchar,
        output: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_rsaes_pkcs1_v15_encrypt"]
    pub fn rsa_rsaes_pkcs1_v15_encrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        ilen: usize,
        input: *const raw_types::c_uchar,
        output: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_rsaes_oaep_encrypt"]
    pub fn rsa_rsaes_oaep_encrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        label: *const raw_types::c_uchar,
        label_len: usize,
        ilen: usize,
        input: *const raw_types::c_uchar,
        output: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_pkcs1_decrypt"]
    pub fn rsa_pkcs1_decrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        olen: *mut usize,
        input: *const raw_types::c_uchar,
        output: *mut raw_types::c_uchar,
        output_max_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_rsaes_pkcs1_v15_decrypt"]
    pub fn rsa_rsaes_pkcs1_v15_decrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        olen: *mut usize,
        input: *const raw_types::c_uchar,
        output: *mut raw_types::c_uchar,
        output_max_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_rsaes_oaep_decrypt"]
    pub fn rsa_rsaes_oaep_decrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        label: *const raw_types::c_uchar,
        label_len: usize,
        olen: *mut usize,
        input: *const raw_types::c_uchar,
        output: *mut raw_types::c_uchar,
        output_max_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_pkcs1_sign"]
    pub fn rsa_pkcs1_sign(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        md_alg: md_type_t,
        hashlen: raw_types::c_uint,
        hash: *const raw_types::c_uchar,
        sig: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_rsassa_pkcs1_v15_sign"]
    pub fn rsa_rsassa_pkcs1_v15_sign(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        md_alg: md_type_t,
        hashlen: raw_types::c_uint,
        hash: *const raw_types::c_uchar,
        sig: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_rsassa_pss_sign"]
    pub fn rsa_rsassa_pss_sign(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        md_alg: md_type_t,
        hashlen: raw_types::c_uint,
        hash: *const raw_types::c_uchar,
        sig: *mut raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_pkcs1_verify"]
    pub fn rsa_pkcs1_verify(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        md_alg: md_type_t,
        hashlen: raw_types::c_uint,
        hash: *const raw_types::c_uchar,
        sig: *const raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_rsassa_pkcs1_v15_verify"]
    pub fn rsa_rsassa_pkcs1_v15_verify(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        md_alg: md_type_t,
        hashlen: raw_types::c_uint,
        hash: *const raw_types::c_uchar,
        sig: *const raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_rsassa_pss_verify"]
    pub fn rsa_rsassa_pss_verify(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        md_alg: md_type_t,
        hashlen: raw_types::c_uint,
        hash: *const raw_types::c_uchar,
        sig: *const raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_rsassa_pss_verify_ext"]
    pub fn rsa_rsassa_pss_verify_ext(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        md_alg: md_type_t,
        hashlen: raw_types::c_uint,
        hash: *const raw_types::c_uchar,
        mgf1_hash_id: md_type_t,
        expected_salt_len: raw_types::c_int,
        sig: *const raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_copy"]
    pub fn rsa_copy(dst: *mut rsa_context, src: *const rsa_context) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_rsa_free"]
    pub fn rsa_free(ctx: *mut rsa_context);
}
extern "C" {
    #[link_name = "mbedtls_rsa_self_test"]
    pub fn rsa_self_test(verbose: raw_types::c_int) -> raw_types::c_int;
}
pub type ecdsa_context = ecp_keypair;
pub type ecdsa_restart_ctx = raw_types::c_void;
extern "C" {
    #[link_name = "mbedtls_ecdsa_sign"]
    pub fn ecdsa_sign(
        grp: *mut ecp_group,
        r: *mut mpi,
        s: *mut mpi,
        d: *const mpi,
        buf: *const raw_types::c_uchar,
        blen: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdsa_sign_det"]
    pub fn ecdsa_sign_det(
        grp: *mut ecp_group,
        r: *mut mpi,
        s: *mut mpi,
        d: *const mpi,
        buf: *const raw_types::c_uchar,
        blen: usize,
        md_alg: md_type_t,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdsa_verify"]
    pub fn ecdsa_verify(
        grp: *mut ecp_group,
        buf: *const raw_types::c_uchar,
        blen: usize,
        Q: *const ecp_point,
        r: *const mpi,
        s: *const mpi,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdsa_write_signature"]
    pub fn ecdsa_write_signature(
        ctx: *mut ecdsa_context,
        md_alg: md_type_t,
        hash: *const raw_types::c_uchar,
        hlen: usize,
        sig: *mut raw_types::c_uchar,
        slen: *mut usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdsa_write_signature_restartable"]
    pub fn ecdsa_write_signature_restartable(
        ctx: *mut ecdsa_context,
        md_alg: md_type_t,
        hash: *const raw_types::c_uchar,
        hlen: usize,
        sig: *mut raw_types::c_uchar,
        slen: *mut usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        rs_ctx: *mut ecdsa_restart_ctx,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdsa_write_signature_det"]
    pub fn ecdsa_write_signature_det(
        ctx: *mut ecdsa_context,
        hash: *const raw_types::c_uchar,
        hlen: usize,
        sig: *mut raw_types::c_uchar,
        slen: *mut usize,
        md_alg: md_type_t,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdsa_read_signature"]
    pub fn ecdsa_read_signature(
        ctx: *mut ecdsa_context,
        hash: *const raw_types::c_uchar,
        hlen: usize,
        sig: *const raw_types::c_uchar,
        slen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdsa_read_signature_restartable"]
    pub fn ecdsa_read_signature_restartable(
        ctx: *mut ecdsa_context,
        hash: *const raw_types::c_uchar,
        hlen: usize,
        sig: *const raw_types::c_uchar,
        slen: usize,
        rs_ctx: *mut ecdsa_restart_ctx,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdsa_genkey"]
    pub fn ecdsa_genkey(
        ctx: *mut ecdsa_context,
        gid: ecp_group_id,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdsa_from_keypair"]
    pub fn ecdsa_from_keypair(ctx: *mut ecdsa_context, key: *const ecp_keypair)
        -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdsa_init"]
    pub fn ecdsa_init(ctx: *mut ecdsa_context);
}
extern "C" {
    #[link_name = "mbedtls_ecdsa_free"]
    pub fn ecdsa_free(ctx: *mut ecdsa_context);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct asn1_buf {
    pub tag: raw_types::c_int,
    pub len: usize,
    pub p: *mut raw_types::c_uchar,
}
#[test]
fn bindgen_test_layout_asn1_buf() {
    assert_eq!(
        ::core::mem::size_of::<asn1_buf>(),
        24usize,
        concat!("Size of: ", stringify!(asn1_buf))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_buf>(),
        8usize,
        concat!("Alignment of ", stringify!(asn1_buf))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_buf>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_buf),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_buf>())).len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_buf),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_buf>())).p as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_buf),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct asn1_bitstring {
    pub len: usize,
    pub unused_bits: raw_types::c_uchar,
    pub p: *mut raw_types::c_uchar,
}
#[test]
fn bindgen_test_layout_asn1_bitstring() {
    assert_eq!(
        ::core::mem::size_of::<asn1_bitstring>(),
        24usize,
        concat!("Size of: ", stringify!(asn1_bitstring))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_bitstring>(),
        8usize,
        concat!("Alignment of ", stringify!(asn1_bitstring))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_bitstring>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_bitstring),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_bitstring>())).unused_bits as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_bitstring),
            "::",
            stringify!(unused_bits)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_bitstring>())).p as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_bitstring),
            "::",
            stringify!(p)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct asn1_sequence {
    pub buf: asn1_buf,
    pub next: *mut asn1_sequence,
}
#[test]
fn bindgen_test_layout_asn1_sequence() {
    assert_eq!(
        ::core::mem::size_of::<asn1_sequence>(),
        32usize,
        concat!("Size of: ", stringify!(asn1_sequence))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_sequence>(),
        8usize,
        concat!("Alignment of ", stringify!(asn1_sequence))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_sequence>())).buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_sequence),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_sequence>())).next as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_sequence),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct asn1_named_data {
    pub oid: asn1_buf,
    pub val: asn1_buf,
    pub next: *mut asn1_named_data,
    pub next_merged: raw_types::c_uchar,
}
#[test]
fn bindgen_test_layout_asn1_named_data() {
    assert_eq!(
        ::core::mem::size_of::<asn1_named_data>(),
        64usize,
        concat!("Size of: ", stringify!(asn1_named_data))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_named_data>(),
        8usize,
        concat!("Alignment of ", stringify!(asn1_named_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_named_data>())).oid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_named_data),
            "::",
            stringify!(oid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_named_data>())).val as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_named_data),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_named_data>())).next as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_named_data),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_named_data>())).next_merged as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_named_data),
            "::",
            stringify!(next_merged)
        )
    );
}
extern "C" {
    #[link_name = "mbedtls_asn1_get_len"]
    pub fn asn1_get_len(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        len: *mut usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_asn1_get_tag"]
    pub fn asn1_get_tag(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        len: *mut usize,
        tag: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_asn1_get_bool"]
    pub fn asn1_get_bool(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        val: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_asn1_get_int"]
    pub fn asn1_get_int(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        val: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_asn1_get_bitstring"]
    pub fn asn1_get_bitstring(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        bs: *mut asn1_bitstring,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_asn1_get_bitstring_null"]
    pub fn asn1_get_bitstring_null(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        len: *mut usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_asn1_get_sequence_of"]
    pub fn asn1_get_sequence_of(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        cur: *mut asn1_sequence,
        tag: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_asn1_get_mpi"]
    pub fn asn1_get_mpi(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        X: *mut mpi,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_asn1_get_alg"]
    pub fn asn1_get_alg(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        alg: *mut asn1_buf,
        params: *mut asn1_buf,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_asn1_get_alg_null"]
    pub fn asn1_get_alg_null(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        alg: *mut asn1_buf,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_asn1_find_named_data"]
    pub fn asn1_find_named_data(
        list: *mut asn1_named_data,
        oid: *const raw_types::c_char,
        len: usize,
    ) -> *mut asn1_named_data;
}
extern "C" {
    #[link_name = "mbedtls_asn1_free_named_data"]
    pub fn asn1_free_named_data(entry: *mut asn1_named_data);
}
extern "C" {
    #[link_name = "mbedtls_asn1_free_named_data_list"]
    pub fn asn1_free_named_data_list(head: *mut *mut asn1_named_data);
}
pub const PK_NONE: pk_type_t = 0;
pub const PK_RSA: pk_type_t = 1;
pub const PK_ECKEY: pk_type_t = 2;
pub const PK_ECKEY_DH: pk_type_t = 3;
pub const PK_ECDSA: pk_type_t = 4;
pub const PK_RSA_ALT: pk_type_t = 5;
pub const PK_RSASSA_PSS: pk_type_t = 6;
pub type pk_type_t = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pk_rsassa_pss_options {
    pub mgf1_hash_id: md_type_t,
    pub expected_salt_len: raw_types::c_int,
}
#[test]
fn bindgen_test_layout_pk_rsassa_pss_options() {
    assert_eq!(
        ::core::mem::size_of::<pk_rsassa_pss_options>(),
        8usize,
        concat!("Size of: ", stringify!(pk_rsassa_pss_options))
    );
    assert_eq!(
        ::core::mem::align_of::<pk_rsassa_pss_options>(),
        4usize,
        concat!("Alignment of ", stringify!(pk_rsassa_pss_options))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<pk_rsassa_pss_options>())).mgf1_hash_id as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pk_rsassa_pss_options),
            "::",
            stringify!(mgf1_hash_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<pk_rsassa_pss_options>())).expected_salt_len as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pk_rsassa_pss_options),
            "::",
            stringify!(expected_salt_len)
        )
    );
}
pub const PK_DEBUG_NONE: pk_debug_type = 0;
pub const PK_DEBUG_MPI: pk_debug_type = 1;
pub const PK_DEBUG_ECP: pk_debug_type = 2;
pub type pk_debug_type = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pk_debug_item {
    pub type_: pk_debug_type,
    pub name: *const raw_types::c_char,
    pub value: *mut raw_types::c_void,
}
#[test]
fn bindgen_test_layout_pk_debug_item() {
    assert_eq!(
        ::core::mem::size_of::<pk_debug_item>(),
        24usize,
        concat!("Size of: ", stringify!(pk_debug_item))
    );
    assert_eq!(
        ::core::mem::align_of::<pk_debug_item>(),
        8usize,
        concat!("Alignment of ", stringify!(pk_debug_item))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pk_debug_item>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pk_debug_item),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pk_debug_item>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pk_debug_item),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pk_debug_item>())).value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pk_debug_item),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pk_context {
    pub pk_info: *const pk_info_t,
    pub pk_ctx: *mut raw_types::c_void,
}
#[test]
fn bindgen_test_layout_pk_context() {
    assert_eq!(
        ::core::mem::size_of::<pk_context>(),
        16usize,
        concat!("Size of: ", stringify!(pk_context))
    );
    assert_eq!(
        ::core::mem::align_of::<pk_context>(),
        8usize,
        concat!("Alignment of ", stringify!(pk_context))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pk_context>())).pk_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pk_context),
            "::",
            stringify!(pk_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pk_context>())).pk_ctx as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pk_context),
            "::",
            stringify!(pk_ctx)
        )
    );
}
pub type pk_restart_ctx = raw_types::c_void;
pub type pk_rsa_alt_decrypt_func = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut raw_types::c_void,
        mode: raw_types::c_int,
        olen: *mut usize,
        input: *const raw_types::c_uchar,
        output: *mut raw_types::c_uchar,
        output_max_len: usize,
    ) -> raw_types::c_int,
>;
pub type pk_rsa_alt_sign_func = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut raw_types::c_void,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        mode: raw_types::c_int,
        md_alg: md_type_t,
        hashlen: raw_types::c_uint,
        hash: *const raw_types::c_uchar,
        sig: *mut raw_types::c_uchar,
    ) -> raw_types::c_int,
>;
pub type pk_rsa_alt_key_len_func =
    ::core::option::Option<unsafe extern "C" fn(ctx: *mut raw_types::c_void) -> usize>;
extern "C" {
    #[link_name = "mbedtls_pk_info_from_type"]
    pub fn pk_info_from_type(pk_type: pk_type_t) -> *const pk_info_t;
}
extern "C" {
    #[link_name = "mbedtls_pk_init"]
    pub fn pk_init(ctx: *mut pk_context);
}
extern "C" {
    #[link_name = "mbedtls_pk_free"]
    pub fn pk_free(ctx: *mut pk_context);
}
extern "C" {
    #[link_name = "mbedtls_pk_setup"]
    pub fn pk_setup(ctx: *mut pk_context, info: *const pk_info_t) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_setup_rsa_alt"]
    pub fn pk_setup_rsa_alt(
        ctx: *mut pk_context,
        key: *mut raw_types::c_void,
        decrypt_func: pk_rsa_alt_decrypt_func,
        sign_func: pk_rsa_alt_sign_func,
        key_len_func: pk_rsa_alt_key_len_func,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_get_bitlen"]
    pub fn pk_get_bitlen(ctx: *const pk_context) -> usize;
}
extern "C" {
    #[link_name = "mbedtls_pk_can_do"]
    pub fn pk_can_do(ctx: *const pk_context, type_: pk_type_t) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_verify"]
    pub fn pk_verify(
        ctx: *mut pk_context,
        md_alg: md_type_t,
        hash: *const raw_types::c_uchar,
        hash_len: usize,
        sig: *const raw_types::c_uchar,
        sig_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_verify_restartable"]
    pub fn pk_verify_restartable(
        ctx: *mut pk_context,
        md_alg: md_type_t,
        hash: *const raw_types::c_uchar,
        hash_len: usize,
        sig: *const raw_types::c_uchar,
        sig_len: usize,
        rs_ctx: *mut pk_restart_ctx,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_verify_ext"]
    pub fn pk_verify_ext(
        type_: pk_type_t,
        options: *const raw_types::c_void,
        ctx: *mut pk_context,
        md_alg: md_type_t,
        hash: *const raw_types::c_uchar,
        hash_len: usize,
        sig: *const raw_types::c_uchar,
        sig_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_sign"]
    pub fn pk_sign(
        ctx: *mut pk_context,
        md_alg: md_type_t,
        hash: *const raw_types::c_uchar,
        hash_len: usize,
        sig: *mut raw_types::c_uchar,
        sig_len: *mut usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_sign_restartable"]
    pub fn pk_sign_restartable(
        ctx: *mut pk_context,
        md_alg: md_type_t,
        hash: *const raw_types::c_uchar,
        hash_len: usize,
        sig: *mut raw_types::c_uchar,
        sig_len: *mut usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
        rs_ctx: *mut pk_restart_ctx,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_decrypt"]
    pub fn pk_decrypt(
        ctx: *mut pk_context,
        input: *const raw_types::c_uchar,
        ilen: usize,
        output: *mut raw_types::c_uchar,
        olen: *mut usize,
        osize: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_encrypt"]
    pub fn pk_encrypt(
        ctx: *mut pk_context,
        input: *const raw_types::c_uchar,
        ilen: usize,
        output: *mut raw_types::c_uchar,
        olen: *mut usize,
        osize: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_check_pair"]
    pub fn pk_check_pair(pub_: *const pk_context, prv: *const pk_context) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_debug"]
    pub fn pk_debug(ctx: *const pk_context, items: *mut pk_debug_item) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_get_name"]
    pub fn pk_get_name(ctx: *const pk_context) -> *const raw_types::c_char;
}
extern "C" {
    #[link_name = "mbedtls_pk_get_type"]
    pub fn pk_get_type(ctx: *const pk_context) -> pk_type_t;
}
extern "C" {
    #[link_name = "mbedtls_pk_parse_key"]
    pub fn pk_parse_key(
        ctx: *mut pk_context,
        key: *const raw_types::c_uchar,
        keylen: usize,
        pwd: *const raw_types::c_uchar,
        pwdlen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_parse_public_key"]
    pub fn pk_parse_public_key(
        ctx: *mut pk_context,
        key: *const raw_types::c_uchar,
        keylen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_parse_keyfile"]
    pub fn pk_parse_keyfile(
        ctx: *mut pk_context,
        path: *const raw_types::c_char,
        password: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_parse_public_keyfile"]
    pub fn pk_parse_public_keyfile(
        ctx: *mut pk_context,
        path: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_write_key_der"]
    pub fn pk_write_key_der(
        ctx: *mut pk_context,
        buf: *mut raw_types::c_uchar,
        size: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_write_pubkey_der"]
    pub fn pk_write_pubkey_der(
        ctx: *mut pk_context,
        buf: *mut raw_types::c_uchar,
        size: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_write_pubkey_pem"]
    pub fn pk_write_pubkey_pem(
        ctx: *mut pk_context,
        buf: *mut raw_types::c_uchar,
        size: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_write_key_pem"]
    pub fn pk_write_key_pem(
        ctx: *mut pk_context,
        buf: *mut raw_types::c_uchar,
        size: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_parse_subpubkey"]
    pub fn pk_parse_subpubkey(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        pk: *mut pk_context,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_write_pubkey"]
    pub fn pk_write_pubkey(
        p: *mut *mut raw_types::c_uchar,
        start: *mut raw_types::c_uchar,
        key: *const pk_context,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_pk_load_file"]
    pub fn pk_load_file(
        path: *const raw_types::c_char,
        buf: *mut *mut raw_types::c_uchar,
        n: *mut usize,
    ) -> raw_types::c_int;
}
pub type x509_buf = asn1_buf;
pub type x509_bitstring = asn1_bitstring;
pub type x509_name = asn1_named_data;
pub type x509_sequence = asn1_sequence;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct x509_time {
    pub year: raw_types::c_int,
    pub mon: raw_types::c_int,
    pub day: raw_types::c_int,
    pub hour: raw_types::c_int,
    pub min: raw_types::c_int,
    pub sec: raw_types::c_int,
}
#[test]
fn bindgen_test_layout_x509_time() {
    assert_eq!(
        ::core::mem::size_of::<x509_time>(),
        24usize,
        concat!("Size of: ", stringify!(x509_time))
    );
    assert_eq!(
        ::core::mem::align_of::<x509_time>(),
        4usize,
        concat!("Alignment of ", stringify!(x509_time))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_time>())).year as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_time),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_time>())).mon as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_time),
            "::",
            stringify!(mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_time>())).day as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_time),
            "::",
            stringify!(day)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_time>())).hour as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_time),
            "::",
            stringify!(hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_time>())).min as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_time),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_time>())).sec as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_time),
            "::",
            stringify!(sec)
        )
    );
}
extern "C" {
    #[link_name = "mbedtls_x509_dn_gets"]
    pub fn x509_dn_gets(
        buf: *mut raw_types::c_char,
        size: usize,
        dn: *const x509_name,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_serial_gets"]
    pub fn x509_serial_gets(
        buf: *mut raw_types::c_char,
        size: usize,
        serial: *const x509_buf,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_time_is_past"]
    pub fn x509_time_is_past(to: *const x509_time) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_time_is_future"]
    pub fn x509_time_is_future(from: *const x509_time) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_self_test"]
    pub fn x509_self_test(verbose: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_get_name"]
    pub fn x509_get_name(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        cur: *mut x509_name,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_get_alg_null"]
    pub fn x509_get_alg_null(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        alg: *mut x509_buf,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_get_alg"]
    pub fn x509_get_alg(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        alg: *mut x509_buf,
        params: *mut x509_buf,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_get_rsassa_pss_params"]
    pub fn x509_get_rsassa_pss_params(
        params: *const x509_buf,
        md_alg: *mut md_type_t,
        mgf_md: *mut md_type_t,
        salt_len: *mut raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_get_sig"]
    pub fn x509_get_sig(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        sig: *mut x509_buf,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_get_sig_alg"]
    pub fn x509_get_sig_alg(
        sig_oid: *const x509_buf,
        sig_params: *const x509_buf,
        md_alg: *mut md_type_t,
        pk_alg: *mut pk_type_t,
        sig_opts: *mut *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_get_time"]
    pub fn x509_get_time(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        t: *mut x509_time,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_get_serial"]
    pub fn x509_get_serial(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        serial: *mut x509_buf,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_get_ext"]
    pub fn x509_get_ext(
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
        ext: *mut x509_buf,
        tag: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_sig_alg_gets"]
    pub fn x509_sig_alg_gets(
        buf: *mut raw_types::c_char,
        size: usize,
        sig_oid: *const x509_buf,
        pk_alg: pk_type_t,
        md_alg: md_type_t,
        sig_opts: *const raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_key_size_helper"]
    pub fn x509_key_size_helper(
        buf: *mut raw_types::c_char,
        buf_size: usize,
        name: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_string_to_names"]
    pub fn x509_string_to_names(
        head: *mut *mut asn1_named_data,
        name: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_set_extension"]
    pub fn x509_set_extension(
        head: *mut *mut asn1_named_data,
        oid: *const raw_types::c_char,
        oid_len: usize,
        critical: raw_types::c_int,
        val: *const raw_types::c_uchar,
        val_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_write_extensions"]
    pub fn x509_write_extensions(
        p: *mut *mut raw_types::c_uchar,
        start: *mut raw_types::c_uchar,
        first: *mut asn1_named_data,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_write_names"]
    pub fn x509_write_names(
        p: *mut *mut raw_types::c_uchar,
        start: *mut raw_types::c_uchar,
        first: *mut asn1_named_data,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_write_sig"]
    pub fn x509_write_sig(
        p: *mut *mut raw_types::c_uchar,
        start: *mut raw_types::c_uchar,
        oid: *const raw_types::c_char,
        oid_len: usize,
        sig: *mut raw_types::c_uchar,
        size: usize,
    ) -> raw_types::c_int;
}
pub type mbedtls_time_t = time_t;
extern "C" {
    #[link_name = "mbedtls_platform_zeroize"]
    pub fn platform_zeroize(buf: *mut raw_types::c_void, len: usize);
}
extern "C" {
    #[link_name = "mbedtls_platform_gmtime_r"]
    pub fn platform_gmtime_r(tt: *const mbedtls_time_t, tm_buf: *mut tm) -> *mut tm;
}
pub const CIPHER_ID_NONE: cipher_id_t = 0;
pub const CIPHER_ID_NULL: cipher_id_t = 1;
pub const CIPHER_ID_AES: cipher_id_t = 2;
pub const CIPHER_ID_DES: cipher_id_t = 3;
pub const CIPHER_ID_3DES: cipher_id_t = 4;
pub const CIPHER_ID_CAMELLIA: cipher_id_t = 5;
pub const CIPHER_ID_BLOWFISH: cipher_id_t = 6;
pub const CIPHER_ID_ARC4: cipher_id_t = 7;
pub const CIPHER_ID_ARIA: cipher_id_t = 8;
pub const CIPHER_ID_CHACHA20: cipher_id_t = 9;
pub type cipher_id_t = u32;
pub const CIPHER_NONE: cipher_type_t = 0;
pub const CIPHER_NULL: cipher_type_t = 1;
pub const CIPHER_AES_128_ECB: cipher_type_t = 2;
pub const CIPHER_AES_192_ECB: cipher_type_t = 3;
pub const CIPHER_AES_256_ECB: cipher_type_t = 4;
pub const CIPHER_AES_128_CBC: cipher_type_t = 5;
pub const CIPHER_AES_192_CBC: cipher_type_t = 6;
pub const CIPHER_AES_256_CBC: cipher_type_t = 7;
pub const CIPHER_AES_128_CFB128: cipher_type_t = 8;
pub const CIPHER_AES_192_CFB128: cipher_type_t = 9;
pub const CIPHER_AES_256_CFB128: cipher_type_t = 10;
pub const CIPHER_AES_128_CTR: cipher_type_t = 11;
pub const CIPHER_AES_192_CTR: cipher_type_t = 12;
pub const CIPHER_AES_256_CTR: cipher_type_t = 13;
pub const CIPHER_AES_128_GCM: cipher_type_t = 14;
pub const CIPHER_AES_192_GCM: cipher_type_t = 15;
pub const CIPHER_AES_256_GCM: cipher_type_t = 16;
pub const CIPHER_CAMELLIA_128_ECB: cipher_type_t = 17;
pub const CIPHER_CAMELLIA_192_ECB: cipher_type_t = 18;
pub const CIPHER_CAMELLIA_256_ECB: cipher_type_t = 19;
pub const CIPHER_CAMELLIA_128_CBC: cipher_type_t = 20;
pub const CIPHER_CAMELLIA_192_CBC: cipher_type_t = 21;
pub const CIPHER_CAMELLIA_256_CBC: cipher_type_t = 22;
pub const CIPHER_CAMELLIA_128_CFB128: cipher_type_t = 23;
pub const CIPHER_CAMELLIA_192_CFB128: cipher_type_t = 24;
pub const CIPHER_CAMELLIA_256_CFB128: cipher_type_t = 25;
pub const CIPHER_CAMELLIA_128_CTR: cipher_type_t = 26;
pub const CIPHER_CAMELLIA_192_CTR: cipher_type_t = 27;
pub const CIPHER_CAMELLIA_256_CTR: cipher_type_t = 28;
pub const CIPHER_CAMELLIA_128_GCM: cipher_type_t = 29;
pub const CIPHER_CAMELLIA_192_GCM: cipher_type_t = 30;
pub const CIPHER_CAMELLIA_256_GCM: cipher_type_t = 31;
pub const CIPHER_DES_ECB: cipher_type_t = 32;
pub const CIPHER_DES_CBC: cipher_type_t = 33;
pub const CIPHER_DES_EDE_ECB: cipher_type_t = 34;
pub const CIPHER_DES_EDE_CBC: cipher_type_t = 35;
pub const CIPHER_DES_EDE3_ECB: cipher_type_t = 36;
pub const CIPHER_DES_EDE3_CBC: cipher_type_t = 37;
pub const CIPHER_BLOWFISH_ECB: cipher_type_t = 38;
pub const CIPHER_BLOWFISH_CBC: cipher_type_t = 39;
pub const CIPHER_BLOWFISH_CFB64: cipher_type_t = 40;
pub const CIPHER_BLOWFISH_CTR: cipher_type_t = 41;
pub const CIPHER_ARC4_128: cipher_type_t = 42;
pub const CIPHER_AES_128_CCM: cipher_type_t = 43;
pub const CIPHER_AES_192_CCM: cipher_type_t = 44;
pub const CIPHER_AES_256_CCM: cipher_type_t = 45;
pub const CIPHER_CAMELLIA_128_CCM: cipher_type_t = 46;
pub const CIPHER_CAMELLIA_192_CCM: cipher_type_t = 47;
pub const CIPHER_CAMELLIA_256_CCM: cipher_type_t = 48;
pub const CIPHER_ARIA_128_ECB: cipher_type_t = 49;
pub const CIPHER_ARIA_192_ECB: cipher_type_t = 50;
pub const CIPHER_ARIA_256_ECB: cipher_type_t = 51;
pub const CIPHER_ARIA_128_CBC: cipher_type_t = 52;
pub const CIPHER_ARIA_192_CBC: cipher_type_t = 53;
pub const CIPHER_ARIA_256_CBC: cipher_type_t = 54;
pub const CIPHER_ARIA_128_CFB128: cipher_type_t = 55;
pub const CIPHER_ARIA_192_CFB128: cipher_type_t = 56;
pub const CIPHER_ARIA_256_CFB128: cipher_type_t = 57;
pub const CIPHER_ARIA_128_CTR: cipher_type_t = 58;
pub const CIPHER_ARIA_192_CTR: cipher_type_t = 59;
pub const CIPHER_ARIA_256_CTR: cipher_type_t = 60;
pub const CIPHER_ARIA_128_GCM: cipher_type_t = 61;
pub const CIPHER_ARIA_192_GCM: cipher_type_t = 62;
pub const CIPHER_ARIA_256_GCM: cipher_type_t = 63;
pub const CIPHER_ARIA_128_CCM: cipher_type_t = 64;
pub const CIPHER_ARIA_192_CCM: cipher_type_t = 65;
pub const CIPHER_ARIA_256_CCM: cipher_type_t = 66;
pub const CIPHER_AES_128_OFB: cipher_type_t = 67;
pub const CIPHER_AES_192_OFB: cipher_type_t = 68;
pub const CIPHER_AES_256_OFB: cipher_type_t = 69;
pub const CIPHER_AES_128_XTS: cipher_type_t = 70;
pub const CIPHER_AES_256_XTS: cipher_type_t = 71;
pub const CIPHER_CHACHA20: cipher_type_t = 72;
pub const CIPHER_CHACHA20_POLY1305: cipher_type_t = 73;
pub type cipher_type_t = u32;
pub const MODE_NONE: cipher_mode_t = 0;
pub const MODE_ECB: cipher_mode_t = 1;
pub const MODE_CBC: cipher_mode_t = 2;
pub const MODE_CFB: cipher_mode_t = 3;
pub const MODE_OFB: cipher_mode_t = 4;
pub const MODE_CTR: cipher_mode_t = 5;
pub const MODE_GCM: cipher_mode_t = 6;
pub const MODE_STREAM: cipher_mode_t = 7;
pub const MODE_CCM: cipher_mode_t = 8;
pub const MODE_XTS: cipher_mode_t = 9;
pub const MODE_CHACHAPOLY: cipher_mode_t = 10;
pub type cipher_mode_t = u32;
pub const PADDING_PKCS7: cipher_padding_t = 0;
pub const PADDING_ONE_AND_ZEROS: cipher_padding_t = 1;
pub const PADDING_ZEROS_AND_LEN: cipher_padding_t = 2;
pub const PADDING_ZEROS: cipher_padding_t = 3;
pub const PADDING_NONE: cipher_padding_t = 4;
pub type cipher_padding_t = u32;
pub const OPERATION_NONE: operation_t = -1;
pub const DECRYPT: operation_t = 0;
pub const ENCRYPT: operation_t = 1;
pub type operation_t = i32;
pub const KEY_LENGTH_NONE: _bindgen_ty_11 = 0;
pub const KEY_LENGTH_DES: _bindgen_ty_11 = 64;
pub const KEY_LENGTH_DES_EDE: _bindgen_ty_11 = 128;
pub const KEY_LENGTH_DES_EDE3: _bindgen_ty_11 = 192;
pub type _bindgen_ty_11 = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cipher_info_t {
    pub type_: cipher_type_t,
    pub mode: cipher_mode_t,
    pub key_bitlen: raw_types::c_uint,
    pub name: *const raw_types::c_char,
    pub iv_size: raw_types::c_uint,
    pub flags: raw_types::c_int,
    pub block_size: raw_types::c_uint,
    pub base: *const cipher_base_t,
}
#[test]
fn bindgen_test_layout_cipher_info_t() {
    assert_eq!(
        ::core::mem::size_of::<cipher_info_t>(),
        48usize,
        concat!("Size of: ", stringify!(cipher_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cipher_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cipher_info_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_info_t>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_info_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_info_t>())).mode as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_info_t),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_info_t>())).key_bitlen as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_info_t),
            "::",
            stringify!(key_bitlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_info_t>())).name as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_info_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_info_t>())).iv_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_info_t),
            "::",
            stringify!(iv_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_info_t>())).flags as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_info_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_info_t>())).block_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_info_t),
            "::",
            stringify!(block_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_info_t>())).base as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_info_t),
            "::",
            stringify!(base)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cipher_context_t {
    pub cipher_info: *const cipher_info_t,
    pub key_bitlen: raw_types::c_int,
    pub operation: operation_t,
    pub add_padding: ::core::option::Option<
        unsafe extern "C" fn(output: *mut raw_types::c_uchar, olen: usize, data_len: usize),
    >,
    pub get_padding: ::core::option::Option<
        unsafe extern "C" fn(
            input: *mut raw_types::c_uchar,
            ilen: usize,
            data_len: *mut usize,
        ) -> raw_types::c_int,
    >,
    pub unprocessed_data: [raw_types::c_uchar; 16usize],
    pub unprocessed_len: usize,
    pub iv: [raw_types::c_uchar; 16usize],
    pub iv_size: usize,
    pub cipher_ctx: *mut raw_types::c_void,
}
#[test]
fn bindgen_test_layout_cipher_context_t() {
    assert_eq!(
        ::core::mem::size_of::<cipher_context_t>(),
        88usize,
        concat!("Size of: ", stringify!(cipher_context_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cipher_context_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cipher_context_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_context_t>())).cipher_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_context_t),
            "::",
            stringify!(cipher_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_context_t>())).key_bitlen as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_context_t),
            "::",
            stringify!(key_bitlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_context_t>())).operation as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_context_t),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_context_t>())).add_padding as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_context_t),
            "::",
            stringify!(add_padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_context_t>())).get_padding as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_context_t),
            "::",
            stringify!(get_padding)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<cipher_context_t>())).unprocessed_data as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_context_t),
            "::",
            stringify!(unprocessed_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<cipher_context_t>())).unprocessed_len as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_context_t),
            "::",
            stringify!(unprocessed_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_context_t>())).iv as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_context_t),
            "::",
            stringify!(iv)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_context_t>())).iv_size as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_context_t),
            "::",
            stringify!(iv_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cipher_context_t>())).cipher_ctx as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(cipher_context_t),
            "::",
            stringify!(cipher_ctx)
        )
    );
}
extern "C" {
    #[link_name = "mbedtls_cipher_list"]
    pub fn cipher_list() -> *const raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_info_from_string"]
    pub fn cipher_info_from_string(cipher_name: *const raw_types::c_char) -> *const cipher_info_t;
}
extern "C" {
    #[link_name = "mbedtls_cipher_info_from_type"]
    pub fn cipher_info_from_type(cipher_type: cipher_type_t) -> *const cipher_info_t;
}
extern "C" {
    #[link_name = "mbedtls_cipher_info_from_values"]
    pub fn cipher_info_from_values(
        cipher_id: cipher_id_t,
        key_bitlen: raw_types::c_int,
        mode: cipher_mode_t,
    ) -> *const cipher_info_t;
}
extern "C" {
    #[link_name = "mbedtls_cipher_init"]
    pub fn cipher_init(ctx: *mut cipher_context_t);
}
extern "C" {
    #[link_name = "mbedtls_cipher_free"]
    pub fn cipher_free(ctx: *mut cipher_context_t);
}
extern "C" {
    #[link_name = "mbedtls_cipher_setup"]
    pub fn cipher_setup(
        ctx: *mut cipher_context_t,
        cipher_info: *const cipher_info_t,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_setkey"]
    pub fn cipher_setkey(
        ctx: *mut cipher_context_t,
        key: *const raw_types::c_uchar,
        key_bitlen: raw_types::c_int,
        operation: operation_t,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_set_padding_mode"]
    pub fn cipher_set_padding_mode(
        ctx: *mut cipher_context_t,
        mode: cipher_padding_t,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_set_iv"]
    pub fn cipher_set_iv(
        ctx: *mut cipher_context_t,
        iv: *const raw_types::c_uchar,
        iv_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_reset"]
    pub fn cipher_reset(ctx: *mut cipher_context_t) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_update_ad"]
    pub fn cipher_update_ad(
        ctx: *mut cipher_context_t,
        ad: *const raw_types::c_uchar,
        ad_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_update"]
    pub fn cipher_update(
        ctx: *mut cipher_context_t,
        input: *const raw_types::c_uchar,
        ilen: usize,
        output: *mut raw_types::c_uchar,
        olen: *mut usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_finish"]
    pub fn cipher_finish(
        ctx: *mut cipher_context_t,
        output: *mut raw_types::c_uchar,
        olen: *mut usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_write_tag"]
    pub fn cipher_write_tag(
        ctx: *mut cipher_context_t,
        tag: *mut raw_types::c_uchar,
        tag_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_check_tag"]
    pub fn cipher_check_tag(
        ctx: *mut cipher_context_t,
        tag: *const raw_types::c_uchar,
        tag_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_crypt"]
    pub fn cipher_crypt(
        ctx: *mut cipher_context_t,
        iv: *const raw_types::c_uchar,
        iv_len: usize,
        input: *const raw_types::c_uchar,
        ilen: usize,
        output: *mut raw_types::c_uchar,
        olen: *mut usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_auth_encrypt"]
    pub fn cipher_auth_encrypt(
        ctx: *mut cipher_context_t,
        iv: *const raw_types::c_uchar,
        iv_len: usize,
        ad: *const raw_types::c_uchar,
        ad_len: usize,
        input: *const raw_types::c_uchar,
        ilen: usize,
        output: *mut raw_types::c_uchar,
        olen: *mut usize,
        tag: *mut raw_types::c_uchar,
        tag_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_cipher_auth_decrypt"]
    pub fn cipher_auth_decrypt(
        ctx: *mut cipher_context_t,
        iv: *const raw_types::c_uchar,
        iv_len: usize,
        ad: *const raw_types::c_uchar,
        ad_len: usize,
        input: *const raw_types::c_uchar,
        ilen: usize,
        output: *mut raw_types::c_uchar,
        olen: *mut usize,
        tag: *const raw_types::c_uchar,
        tag_len: usize,
    ) -> raw_types::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct x509_crl_entry {
    pub raw: x509_buf,
    pub serial: x509_buf,
    pub revocation_date: x509_time,
    pub entry_ext: x509_buf,
    pub next: *mut x509_crl_entry,
}
#[test]
fn bindgen_test_layout_x509_crl_entry() {
    assert_eq!(
        ::core::mem::size_of::<x509_crl_entry>(),
        104usize,
        concat!("Size of: ", stringify!(x509_crl_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<x509_crl_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(x509_crl_entry))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl_entry>())).raw as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl_entry),
            "::",
            stringify!(raw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl_entry>())).serial as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl_entry),
            "::",
            stringify!(serial)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl_entry>())).revocation_date as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl_entry),
            "::",
            stringify!(revocation_date)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl_entry>())).entry_ext as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl_entry),
            "::",
            stringify!(entry_ext)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl_entry>())).next as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl_entry),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct x509_crl {
    pub raw: x509_buf,
    pub tbs: x509_buf,
    pub version: raw_types::c_int,
    pub sig_oid: x509_buf,
    pub issuer_raw: x509_buf,
    pub issuer: x509_name,
    pub this_update: x509_time,
    pub next_update: x509_time,
    pub entry: x509_crl_entry,
    pub crl_ext: x509_buf,
    pub sig_oid2: x509_buf,
    pub sig: x509_buf,
    pub sig_md: md_type_t,
    pub sig_pk: pk_type_t,
    pub sig_opts: *mut raw_types::c_void,
    pub next: *mut x509_crl,
}
#[test]
fn bindgen_test_layout_x509_crl() {
    assert_eq!(
        ::core::mem::size_of::<x509_crl>(),
        416usize,
        concat!("Size of: ", stringify!(x509_crl))
    );
    assert_eq!(
        ::core::mem::align_of::<x509_crl>(),
        8usize,
        concat!("Alignment of ", stringify!(x509_crl))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).raw as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(raw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).tbs as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(tbs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).version as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).sig_oid as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(sig_oid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).issuer_raw as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(issuer_raw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).issuer as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(issuer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).this_update as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(this_update)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).next_update as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(next_update)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).entry as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(entry)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).crl_ext as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(crl_ext)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).sig_oid2 as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(sig_oid2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).sig as *const _ as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(sig)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).sig_md as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(sig_md)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).sig_pk as *const _ as usize },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(sig_pk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).sig_opts as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(sig_opts)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crl>())).next as *const _ as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crl),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    #[link_name = "mbedtls_x509_crl_parse_der"]
    pub fn x509_crl_parse_der(
        chain: *mut x509_crl,
        buf: *const raw_types::c_uchar,
        buflen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crl_parse"]
    pub fn x509_crl_parse(
        chain: *mut x509_crl,
        buf: *const raw_types::c_uchar,
        buflen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crl_parse_file"]
    pub fn x509_crl_parse_file(
        chain: *mut x509_crl,
        path: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crl_info"]
    pub fn x509_crl_info(
        buf: *mut raw_types::c_char,
        size: usize,
        prefix: *const raw_types::c_char,
        crl: *const x509_crl,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crl_init"]
    pub fn x509_crl_init(crl: *mut x509_crl);
}
extern "C" {
    #[link_name = "mbedtls_x509_crl_free"]
    pub fn x509_crl_free(crl: *mut x509_crl);
}
pub const KEY_EXCHANGE_NONE: key_exchange_type_t = 0;
pub const KEY_EXCHANGE_RSA: key_exchange_type_t = 1;
pub const KEY_EXCHANGE_DHE_RSA: key_exchange_type_t = 2;
pub const KEY_EXCHANGE_ECDHE_RSA: key_exchange_type_t = 3;
pub const KEY_EXCHANGE_ECDHE_ECDSA: key_exchange_type_t = 4;
pub const KEY_EXCHANGE_PSK: key_exchange_type_t = 5;
pub const KEY_EXCHANGE_DHE_PSK: key_exchange_type_t = 6;
pub const KEY_EXCHANGE_RSA_PSK: key_exchange_type_t = 7;
pub const KEY_EXCHANGE_ECDHE_PSK: key_exchange_type_t = 8;
pub const KEY_EXCHANGE_ECDH_RSA: key_exchange_type_t = 9;
pub const KEY_EXCHANGE_ECDH_ECDSA: key_exchange_type_t = 10;
pub const KEY_EXCHANGE_ECJPAKE: key_exchange_type_t = 11;
pub type key_exchange_type_t = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ssl_ciphersuite_t {
    pub id: raw_types::c_int,
    pub name: *const raw_types::c_char,
    pub cipher: cipher_type_t,
    pub mac: md_type_t,
    pub key_exchange: key_exchange_type_t,
    pub min_major_ver: raw_types::c_int,
    pub min_minor_ver: raw_types::c_int,
    pub max_major_ver: raw_types::c_int,
    pub max_minor_ver: raw_types::c_int,
    pub flags: raw_types::c_uchar,
}
#[test]
fn bindgen_test_layout_ssl_ciphersuite_t() {
    assert_eq!(
        ::core::mem::size_of::<ssl_ciphersuite_t>(),
        48usize,
        concat!("Size of: ", stringify!(ssl_ciphersuite_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ssl_ciphersuite_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ssl_ciphersuite_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ssl_ciphersuite_t>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ssl_ciphersuite_t),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ssl_ciphersuite_t>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ssl_ciphersuite_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ssl_ciphersuite_t>())).cipher as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ssl_ciphersuite_t),
            "::",
            stringify!(cipher)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ssl_ciphersuite_t>())).mac as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ssl_ciphersuite_t),
            "::",
            stringify!(mac)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ssl_ciphersuite_t>())).key_exchange as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ssl_ciphersuite_t),
            "::",
            stringify!(key_exchange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ssl_ciphersuite_t>())).min_major_ver as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ssl_ciphersuite_t),
            "::",
            stringify!(min_major_ver)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ssl_ciphersuite_t>())).min_minor_ver as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ssl_ciphersuite_t),
            "::",
            stringify!(min_minor_ver)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ssl_ciphersuite_t>())).max_major_ver as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ssl_ciphersuite_t),
            "::",
            stringify!(max_major_ver)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ssl_ciphersuite_t>())).max_minor_ver as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ssl_ciphersuite_t),
            "::",
            stringify!(max_minor_ver)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ssl_ciphersuite_t>())).flags as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ssl_ciphersuite_t),
            "::",
            stringify!(flags)
        )
    );
}
extern "C" {
    #[link_name = "mbedtls_ssl_list_ciphersuites"]
    pub fn ssl_list_ciphersuites() -> *const raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ssl_ciphersuite_from_string"]
    pub fn ssl_ciphersuite_from_string(
        ciphersuite_name: *const raw_types::c_char,
    ) -> *const ssl_ciphersuite_t;
}
extern "C" {
    #[link_name = "mbedtls_ssl_ciphersuite_from_id"]
    pub fn ssl_ciphersuite_from_id(ciphersuite_id: raw_types::c_int) -> *const ssl_ciphersuite_t;
}
extern "C" {
    #[link_name = "mbedtls_ssl_get_ciphersuite_sig_pk_alg"]
    pub fn ssl_get_ciphersuite_sig_pk_alg(info: *const ssl_ciphersuite_t) -> pk_type_t;
}
extern "C" {
    #[link_name = "mbedtls_ssl_get_ciphersuite_sig_alg"]
    pub fn ssl_get_ciphersuite_sig_alg(info: *const ssl_ciphersuite_t) -> pk_type_t;
}
extern "C" {
    #[link_name = "mbedtls_ssl_ciphersuite_uses_ec"]
    pub fn ssl_ciphersuite_uses_ec(info: *const ssl_ciphersuite_t) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ssl_ciphersuite_uses_psk"]
    pub fn ssl_ciphersuite_uses_psk(info: *const ssl_ciphersuite_t) -> raw_types::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct x509_crt {
    pub raw: x509_buf,
    pub tbs: x509_buf,
    pub version: raw_types::c_int,
    pub serial: x509_buf,
    pub sig_oid: x509_buf,
    pub issuer_raw: x509_buf,
    pub subject_raw: x509_buf,
    pub issuer: x509_name,
    pub subject: x509_name,
    pub valid_from: x509_time,
    pub valid_to: x509_time,
    pub pk: pk_context,
    pub issuer_id: x509_buf,
    pub subject_id: x509_buf,
    pub v3_ext: x509_buf,
    pub subject_alt_names: x509_sequence,
    pub ext_types: raw_types::c_int,
    pub ca_istrue: raw_types::c_int,
    pub max_pathlen: raw_types::c_int,
    pub key_usage: raw_types::c_uint,
    pub ext_key_usage: x509_sequence,
    pub ns_cert_type: raw_types::c_uchar,
    pub sig: x509_buf,
    pub sig_md: md_type_t,
    pub sig_pk: pk_type_t,
    pub sig_opts: *mut raw_types::c_void,
    pub next: *mut x509_crt,
}
#[test]
fn bindgen_test_layout_x509_crt() {
    assert_eq!(
        ::core::mem::size_of::<x509_crt>(),
        552usize,
        concat!("Size of: ", stringify!(x509_crt))
    );
    assert_eq!(
        ::core::mem::align_of::<x509_crt>(),
        8usize,
        concat!("Alignment of ", stringify!(x509_crt))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).raw as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(raw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).tbs as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(tbs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).version as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).serial as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(serial)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).sig_oid as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(sig_oid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).issuer_raw as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(issuer_raw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).subject_raw as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(subject_raw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).issuer as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(issuer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).subject as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(subject)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).valid_from as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(valid_from)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).valid_to as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(valid_to)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).pk as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(pk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).issuer_id as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(issuer_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).subject_id as *const _ as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(subject_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).v3_ext as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(v3_ext)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).subject_alt_names as *const _ as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(subject_alt_names)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).ext_types as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(ext_types)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).ca_istrue as *const _ as usize },
        452usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(ca_istrue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).max_pathlen as *const _ as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(max_pathlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).key_usage as *const _ as usize },
        460usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(key_usage)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).ext_key_usage as *const _ as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(ext_key_usage)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).ns_cert_type as *const _ as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(ns_cert_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).sig as *const _ as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(sig)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).sig_md as *const _ as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(sig_md)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).sig_pk as *const _ as usize },
        532usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(sig_pk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).sig_opts as *const _ as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(sig_opts)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt>())).next as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct x509_crt_profile {
    pub allowed_mds: u32,
    pub allowed_pks: u32,
    pub allowed_curves: u32,
    pub rsa_min_bitlen: u32,
}
#[test]
fn bindgen_test_layout_x509_crt_profile() {
    assert_eq!(
        ::core::mem::size_of::<x509_crt_profile>(),
        16usize,
        concat!("Size of: ", stringify!(x509_crt_profile))
    );
    assert_eq!(
        ::core::mem::align_of::<x509_crt_profile>(),
        4usize,
        concat!("Alignment of ", stringify!(x509_crt_profile))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt_profile>())).allowed_mds as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt_profile),
            "::",
            stringify!(allowed_mds)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt_profile>())).allowed_pks as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt_profile),
            "::",
            stringify!(allowed_pks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<x509_crt_profile>())).allowed_curves as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt_profile),
            "::",
            stringify!(allowed_curves)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<x509_crt_profile>())).rsa_min_bitlen as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt_profile),
            "::",
            stringify!(rsa_min_bitlen)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct x509write_cert {
    pub version: raw_types::c_int,
    pub serial: mpi,
    pub subject_key: *mut pk_context,
    pub issuer_key: *mut pk_context,
    pub subject: *mut asn1_named_data,
    pub issuer: *mut asn1_named_data,
    pub md_alg: md_type_t,
    pub not_before: [raw_types::c_char; 16usize],
    pub not_after: [raw_types::c_char; 16usize],
    pub extensions: *mut asn1_named_data,
}
#[test]
fn bindgen_test_layout_x509write_cert() {
    assert_eq!(
        ::core::mem::size_of::<x509write_cert>(),
        112usize,
        concat!("Size of: ", stringify!(x509write_cert))
    );
    assert_eq!(
        ::core::mem::align_of::<x509write_cert>(),
        8usize,
        concat!("Alignment of ", stringify!(x509write_cert))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509write_cert>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(x509write_cert),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509write_cert>())).serial as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(x509write_cert),
            "::",
            stringify!(serial)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509write_cert>())).subject_key as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(x509write_cert),
            "::",
            stringify!(subject_key)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509write_cert>())).issuer_key as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(x509write_cert),
            "::",
            stringify!(issuer_key)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509write_cert>())).subject as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(x509write_cert),
            "::",
            stringify!(subject)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509write_cert>())).issuer as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(x509write_cert),
            "::",
            stringify!(issuer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509write_cert>())).md_alg as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(x509write_cert),
            "::",
            stringify!(md_alg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509write_cert>())).not_before as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(x509write_cert),
            "::",
            stringify!(not_before)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509write_cert>())).not_after as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(x509write_cert),
            "::",
            stringify!(not_after)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509write_cert>())).extensions as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(x509write_cert),
            "::",
            stringify!(extensions)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct x509_crt_verify_chain_item {
    pub crt: *mut x509_crt,
    pub flags: u32,
}
#[test]
fn bindgen_test_layout_x509_crt_verify_chain_item() {
    assert_eq!(
        ::core::mem::size_of::<x509_crt_verify_chain_item>(),
        16usize,
        concat!("Size of: ", stringify!(x509_crt_verify_chain_item))
    );
    assert_eq!(
        ::core::mem::align_of::<x509_crt_verify_chain_item>(),
        8usize,
        concat!("Alignment of ", stringify!(x509_crt_verify_chain_item))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt_verify_chain_item>())).crt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt_verify_chain_item),
            "::",
            stringify!(crt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<x509_crt_verify_chain_item>())).flags as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt_verify_chain_item),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct x509_crt_verify_chain {
    pub items: [x509_crt_verify_chain_item; 10usize],
    pub len: raw_types::c_uint,
}
#[test]
fn bindgen_test_layout_x509_crt_verify_chain() {
    assert_eq!(
        ::core::mem::size_of::<x509_crt_verify_chain>(),
        168usize,
        concat!("Size of: ", stringify!(x509_crt_verify_chain))
    );
    assert_eq!(
        ::core::mem::align_of::<x509_crt_verify_chain>(),
        8usize,
        concat!("Alignment of ", stringify!(x509_crt_verify_chain))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt_verify_chain>())).items as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt_verify_chain),
            "::",
            stringify!(items)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<x509_crt_verify_chain>())).len as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(x509_crt_verify_chain),
            "::",
            stringify!(len)
        )
    );
}
pub type x509_crt_restart_ctx = raw_types::c_void;
extern "C" {
    #[link_name = "mbedtls_x509_crt_profile_default"]
    pub static x509_crt_profile_default: x509_crt_profile;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_profile_next"]
    pub static x509_crt_profile_next: x509_crt_profile;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_profile_suiteb"]
    pub static x509_crt_profile_suiteb: x509_crt_profile;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_parse_der"]
    pub fn x509_crt_parse_der(
        chain: *mut x509_crt,
        buf: *const raw_types::c_uchar,
        buflen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_parse"]
    pub fn x509_crt_parse(
        chain: *mut x509_crt,
        buf: *const raw_types::c_uchar,
        buflen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_parse_file"]
    pub fn x509_crt_parse_file(
        chain: *mut x509_crt,
        path: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_parse_path"]
    pub fn x509_crt_parse_path(
        chain: *mut x509_crt,
        path: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_info"]
    pub fn x509_crt_info(
        buf: *mut raw_types::c_char,
        size: usize,
        prefix: *const raw_types::c_char,
        crt: *const x509_crt,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_verify_info"]
    pub fn x509_crt_verify_info(
        buf: *mut raw_types::c_char,
        size: usize,
        prefix: *const raw_types::c_char,
        flags: u32,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_verify"]
    pub fn x509_crt_verify(
        crt: *mut x509_crt,
        trust_ca: *mut x509_crt,
        ca_crl: *mut x509_crl,
        cn: *const raw_types::c_char,
        flags: *mut u32,
        f_vrfy: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut x509_crt,
                arg3: raw_types::c_int,
                arg4: *mut u32,
            ) -> raw_types::c_int,
        >,
        p_vrfy: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_verify_with_profile"]
    pub fn x509_crt_verify_with_profile(
        crt: *mut x509_crt,
        trust_ca: *mut x509_crt,
        ca_crl: *mut x509_crl,
        profile: *const x509_crt_profile,
        cn: *const raw_types::c_char,
        flags: *mut u32,
        f_vrfy: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut x509_crt,
                arg3: raw_types::c_int,
                arg4: *mut u32,
            ) -> raw_types::c_int,
        >,
        p_vrfy: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_verify_restartable"]
    pub fn x509_crt_verify_restartable(
        crt: *mut x509_crt,
        trust_ca: *mut x509_crt,
        ca_crl: *mut x509_crl,
        profile: *const x509_crt_profile,
        cn: *const raw_types::c_char,
        flags: *mut u32,
        f_vrfy: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut x509_crt,
                arg3: raw_types::c_int,
                arg4: *mut u32,
            ) -> raw_types::c_int,
        >,
        p_vrfy: *mut raw_types::c_void,
        rs_ctx: *mut x509_crt_restart_ctx,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_check_key_usage"]
    pub fn x509_crt_check_key_usage(
        crt: *const x509_crt,
        usage: raw_types::c_uint,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_check_extended_key_usage"]
    pub fn x509_crt_check_extended_key_usage(
        crt: *const x509_crt,
        usage_oid: *const raw_types::c_char,
        usage_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_is_revoked"]
    pub fn x509_crt_is_revoked(crt: *const x509_crt, crl: *const x509_crl) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_init"]
    pub fn x509_crt_init(crt: *mut x509_crt);
}
extern "C" {
    #[link_name = "mbedtls_x509_crt_free"]
    pub fn x509_crt_free(crt: *mut x509_crt);
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_init"]
    pub fn x509write_crt_init(ctx: *mut x509write_cert);
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_version"]
    pub fn x509write_crt_set_version(ctx: *mut x509write_cert, version: raw_types::c_int);
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_serial"]
    pub fn x509write_crt_set_serial(
        ctx: *mut x509write_cert,
        serial: *const mpi,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_validity"]
    pub fn x509write_crt_set_validity(
        ctx: *mut x509write_cert,
        not_before: *const raw_types::c_char,
        not_after: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_issuer_name"]
    pub fn x509write_crt_set_issuer_name(
        ctx: *mut x509write_cert,
        issuer_name: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_subject_name"]
    pub fn x509write_crt_set_subject_name(
        ctx: *mut x509write_cert,
        subject_name: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_subject_key"]
    pub fn x509write_crt_set_subject_key(ctx: *mut x509write_cert, key: *mut pk_context);
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_issuer_key"]
    pub fn x509write_crt_set_issuer_key(ctx: *mut x509write_cert, key: *mut pk_context);
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_md_alg"]
    pub fn x509write_crt_set_md_alg(ctx: *mut x509write_cert, md_alg: md_type_t);
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_extension"]
    pub fn x509write_crt_set_extension(
        ctx: *mut x509write_cert,
        oid: *const raw_types::c_char,
        oid_len: usize,
        critical: raw_types::c_int,
        val: *const raw_types::c_uchar,
        val_len: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_basic_constraints"]
    pub fn x509write_crt_set_basic_constraints(
        ctx: *mut x509write_cert,
        is_ca: raw_types::c_int,
        max_pathlen: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_subject_key_identifier"]
    pub fn x509write_crt_set_subject_key_identifier(ctx: *mut x509write_cert) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_authority_key_identifier"]
    pub fn x509write_crt_set_authority_key_identifier(ctx: *mut x509write_cert)
        -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_key_usage"]
    pub fn x509write_crt_set_key_usage(
        ctx: *mut x509write_cert,
        key_usage: raw_types::c_uint,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_set_ns_cert_type"]
    pub fn x509write_crt_set_ns_cert_type(
        ctx: *mut x509write_cert,
        ns_cert_type: raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_free"]
    pub fn x509write_crt_free(ctx: *mut x509write_cert);
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_der"]
    pub fn x509write_crt_der(
        ctx: *mut x509write_cert,
        buf: *mut raw_types::c_uchar,
        size: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_x509write_crt_pem"]
    pub fn x509write_crt_pem(
        ctx: *mut x509write_cert,
        buf: *mut raw_types::c_uchar,
        size: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dhm_context {
    pub len: usize,
    pub P: mpi,
    pub G: mpi,
    pub X: mpi,
    pub GX: mpi,
    pub GY: mpi,
    pub K: mpi,
    pub RP: mpi,
    pub Vi: mpi,
    pub Vf: mpi,
    pub pX: mpi,
}
#[test]
fn bindgen_test_layout_dhm_context() {
    assert_eq!(
        ::core::mem::size_of::<dhm_context>(),
        248usize,
        concat!("Size of: ", stringify!(dhm_context))
    );
    assert_eq!(
        ::core::mem::align_of::<dhm_context>(),
        8usize,
        concat!("Alignment of ", stringify!(dhm_context))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dhm_context>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dhm_context),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dhm_context>())).P as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dhm_context),
            "::",
            stringify!(P)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dhm_context>())).G as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dhm_context),
            "::",
            stringify!(G)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dhm_context>())).X as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(dhm_context),
            "::",
            stringify!(X)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dhm_context>())).GX as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(dhm_context),
            "::",
            stringify!(GX)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dhm_context>())).GY as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(dhm_context),
            "::",
            stringify!(GY)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dhm_context>())).K as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(dhm_context),
            "::",
            stringify!(K)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dhm_context>())).RP as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(dhm_context),
            "::",
            stringify!(RP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dhm_context>())).Vi as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(dhm_context),
            "::",
            stringify!(Vi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dhm_context>())).Vf as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(dhm_context),
            "::",
            stringify!(Vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dhm_context>())).pX as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(dhm_context),
            "::",
            stringify!(pX)
        )
    );
}
extern "C" {
    #[link_name = "mbedtls_dhm_init"]
    pub fn dhm_init(ctx: *mut dhm_context);
}
extern "C" {
    #[link_name = "mbedtls_dhm_read_params"]
    pub fn dhm_read_params(
        ctx: *mut dhm_context,
        p: *mut *mut raw_types::c_uchar,
        end: *const raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_dhm_make_params"]
    pub fn dhm_make_params(
        ctx: *mut dhm_context,
        x_size: raw_types::c_int,
        output: *mut raw_types::c_uchar,
        olen: *mut usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_dhm_set_group"]
    pub fn dhm_set_group(ctx: *mut dhm_context, P: *const mpi, G: *const mpi) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_dhm_read_public"]
    pub fn dhm_read_public(
        ctx: *mut dhm_context,
        input: *const raw_types::c_uchar,
        ilen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_dhm_make_public"]
    pub fn dhm_make_public(
        ctx: *mut dhm_context,
        x_size: raw_types::c_int,
        output: *mut raw_types::c_uchar,
        olen: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_dhm_calc_secret"]
    pub fn dhm_calc_secret(
        ctx: *mut dhm_context,
        output: *mut raw_types::c_uchar,
        output_size: usize,
        olen: *mut usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_dhm_free"]
    pub fn dhm_free(ctx: *mut dhm_context);
}
extern "C" {
    #[link_name = "mbedtls_dhm_parse_dhm"]
    pub fn dhm_parse_dhm(
        dhm: *mut dhm_context,
        dhmin: *const raw_types::c_uchar,
        dhminlen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_dhm_parse_dhmfile"]
    pub fn dhm_parse_dhmfile(
        dhm: *mut dhm_context,
        path: *const raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_dhm_self_test"]
    pub fn dhm_self_test(verbose: raw_types::c_int) -> raw_types::c_int;
}
pub const ECDH_OURS: ecdh_side = 0;
pub const ECDH_THEIRS: ecdh_side = 1;
pub type ecdh_side = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ecdh_context {
    pub grp: ecp_group,
    pub d: mpi,
    pub Q: ecp_point,
    pub Qp: ecp_point,
    pub z: mpi,
    pub point_format: raw_types::c_int,
    pub Vi: ecp_point,
    pub Vf: ecp_point,
    pub _d: mpi,
}
#[test]
fn bindgen_test_layout_ecdh_context() {
    assert_eq!(
        ::core::mem::size_of::<ecdh_context>(),
        616usize,
        concat!("Size of: ", stringify!(ecdh_context))
    );
    assert_eq!(
        ::core::mem::align_of::<ecdh_context>(),
        8usize,
        concat!("Alignment of ", stringify!(ecdh_context))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).grp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(grp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).d as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).Q as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(Q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).Qp as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(Qp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).z as *const _ as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).point_format as *const _ as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(point_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).Vi as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(Vi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).Vf as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(Vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>()))._d as *const _ as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(_d)
        )
    );
}
extern "C" {
    #[link_name = "mbedtls_ecdh_gen_public"]
    pub fn ecdh_gen_public(
        grp: *mut ecp_group,
        d: *mut mpi,
        Q: *mut ecp_point,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdh_compute_shared"]
    pub fn ecdh_compute_shared(
        grp: *mut ecp_group,
        z: *mut mpi,
        Q: *const ecp_point,
        d: *const mpi,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdh_init"]
    pub fn ecdh_init(ctx: *mut ecdh_context);
}
extern "C" {
    #[link_name = "mbedtls_ecdh_setup"]
    pub fn ecdh_setup(ctx: *mut ecdh_context, grp_id: ecp_group_id) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdh_free"]
    pub fn ecdh_free(ctx: *mut ecdh_context);
}
extern "C" {
    #[link_name = "mbedtls_ecdh_make_params"]
    pub fn ecdh_make_params(
        ctx: *mut ecdh_context,
        olen: *mut usize,
        buf: *mut raw_types::c_uchar,
        blen: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdh_read_params"]
    pub fn ecdh_read_params(
        ctx: *mut ecdh_context,
        buf: *mut *const raw_types::c_uchar,
        end: *const raw_types::c_uchar,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdh_get_params"]
    pub fn ecdh_get_params(
        ctx: *mut ecdh_context,
        key: *const ecp_keypair,
        side: ecdh_side,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdh_make_public"]
    pub fn ecdh_make_public(
        ctx: *mut ecdh_context,
        olen: *mut usize,
        buf: *mut raw_types::c_uchar,
        blen: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdh_read_public"]
    pub fn ecdh_read_public(
        ctx: *mut ecdh_context,
        buf: *const raw_types::c_uchar,
        blen: usize,
    ) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "mbedtls_ecdh_calc_secret"]
    pub fn ecdh_calc_secret(
        ctx: *mut ecdh_context,
        olen: *mut usize,
        buf: *mut raw_types::c_uchar,
        blen: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut raw_types::c_void,
                arg2: *mut raw_types::c_uchar,
                arg3: usize,
            ) -> raw_types::c_int,
        >,
        p_rng: *mut raw_types::c_void,
    ) -> raw_types::c_int;
}
pub type z_size_t = usize;
pub type Byte = raw_types::c_uchar;
pub type uInt = raw_types::c_uint;
pub type uLong = raw_types::c_ulong;
pub type Bytef = Byte;
pub type charf = raw_types::c_char;
pub type intf = raw_types::c_int;
pub type uIntf = uInt;
pub type uLongf = uLong;
pub type voidpc = *const raw_types::c_void;
pub type voidpf = *mut raw_types::c_void;
pub type voidp = *mut raw_types::c_void;
pub type z_crc_t = raw_types::c_uint;
pub type useconds_t = __useconds_t;
pub type socklen_t = __socklen_t;
extern "C" {
    pub fn access(__name: *const raw_types::c_char, __type: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn faccessat(
        __fd: raw_types::c_int,
        __file: *const raw_types::c_char,
        __type: raw_types::c_int,
        __flag: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn lseek(__fd: raw_types::c_int, __offset: __off_t, __whence: raw_types::c_int) -> __off_t;
}
extern "C" {
    pub fn close(__fd: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn read(__fd: raw_types::c_int, __buf: *mut raw_types::c_void, __nbytes: usize) -> isize;
}
extern "C" {
    pub fn write(__fd: raw_types::c_int, __buf: *const raw_types::c_void, __n: usize) -> isize;
}
extern "C" {
    pub fn pread(
        __fd: raw_types::c_int,
        __buf: *mut raw_types::c_void,
        __nbytes: usize,
        __offset: __off_t,
    ) -> isize;
}
extern "C" {
    pub fn pwrite(
        __fd: raw_types::c_int,
        __buf: *const raw_types::c_void,
        __n: usize,
        __offset: __off_t,
    ) -> isize;
}
extern "C" {
    pub fn pipe(__pipedes: *mut raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn alarm(__seconds: raw_types::c_uint) -> raw_types::c_uint;
}
extern "C" {
    pub fn sleep(__seconds: raw_types::c_uint) -> raw_types::c_uint;
}
extern "C" {
    pub fn ualarm(__value: __useconds_t, __interval: __useconds_t) -> __useconds_t;
}
extern "C" {
    pub fn usleep(__useconds: __useconds_t) -> raw_types::c_int;
}
extern "C" {
    pub fn pause() -> raw_types::c_int;
}
extern "C" {
    pub fn chown(
        __file: *const raw_types::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn fchown(__fd: raw_types::c_int, __owner: __uid_t, __group: __gid_t) -> raw_types::c_int;
}
extern "C" {
    pub fn lchown(
        __file: *const raw_types::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn fchownat(
        __fd: raw_types::c_int,
        __file: *const raw_types::c_char,
        __owner: __uid_t,
        __group: __gid_t,
        __flag: raw_types::c_int,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn chdir(__path: *const raw_types::c_char) -> raw_types::c_int;
}
extern "C" {
    pub fn fchdir(__fd: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn getcwd(__buf: *mut raw_types::c_char, __size: usize) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn getwd(__buf: *mut raw_types::c_char) -> *mut raw_types::c_char;
}
extern "C" {
    pub fn dup(__fd: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn dup2(__fd: raw_types::c_int, __fd2: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    #[link_name = "__environ"]
    pub static mut __environ: *mut *mut raw_types::c_char;
}
extern "C" {
    pub fn execve(
        __path: *const raw_types::c_char,
        __argv: *const *mut raw_types::c_char,
        __envp: *const *mut raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn fexecve(
        __fd: raw_types::c_int,
        __argv: *const *mut raw_types::c_char,
        __envp: *const *mut raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn execv(
        __path: *const raw_types::c_char,
        __argv: *const *mut raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn execle(
        __path: *const raw_types::c_char,
        __arg: *const raw_types::c_char,
        ...
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn execl(
        __path: *const raw_types::c_char,
        __arg: *const raw_types::c_char,
        ...
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn execvp(
        __file: *const raw_types::c_char,
        __argv: *const *mut raw_types::c_char,
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn execlp(
        __file: *const raw_types::c_char,
        __arg: *const raw_types::c_char,
        ...
    ) -> raw_types::c_int;
}
extern "C" {
    pub fn nice(__inc: raw_types::c_int) -> raw_types::c_int;
}
extern "C" {
    pub fn _exit(__status: raw_types::c_int);
}
pub const _PC_LINK_MAX: _bindgen_ty_12 = 0;
pub const _PC_MAX_CANON: _bindgen_ty_12 = 1;
pub const _PC_MAX_INPUT: _bindgen_ty_12 = 2;
pub const _PC_NAME_MAX: _bindgen_ty_12 = 3;
pub const _PC_PATH_MAX: _bindgen_ty_12 = 4;
pub const _PC_PIPE_BUF: _bindgen_ty_12 = 5;
pub const _PC_CHOWN_RESTRICTED: _bindgen_ty_12 = 6;
pub const _PC_NO_TRUNC: _bindgen_ty_12 = 7;
pub const _PC_VDISABLE: _bindgen_ty_12 = 8;
pub const _PC_SYNC_IO: _bindgen_ty_12 = 9;
pub const _PC_ASYNC_IO: _bindgen_ty_12 = 10;
pub const _PC_PRIO_IO: _bindgen_ty_12 = 11;
pub const _PC_SOCK_MAXBUF: _bindgen_ty_12 = 12;
pub const _PC_FILESIZEBITS: _bindgen_ty_12 = 13;
pub const _PC_REC_INCR_XFER_SIZE: _bindgen_ty_12 = 14;
pub const _PC_REC_MAX_XFER_SIZE: _bindgen_ty_12 = 15;
pub const _PC_REC_MIN_XFER_SIZE: _bindgen_ty_12 = 16;
pub const _PC_REC_XFER_ALIGN: _bindgen_ty_12 = 17;
pub const _PC_ALLOC_SIZE_MIN: _bindgen_ty_12 = 18;
pub const _PC_SYMLINK_MAX: _bindgen_ty_12 = 19;
pub const _PC_2_SYMLINKS: _bindgen_ty_12 = 20;
pub type _bindgen_ty_12 = u32;
pub const _SC_ARG_MAX: _bindgen_ty_13 = 0;
pub const _SC_CHILD_MAX: _bindgen_ty_13 = 1;
pub const _SC_CLK_TCK: _bindgen_ty_13 = 2;
pub const _SC_NGROUPS_MAX: _bindgen_ty_13 = 3;
pub const _SC_OPEN_MAX: _bindgen_ty_13 = 4;
pub const _SC_STREAM_MAX: _bindgen_ty_13 = 5;
pub const _SC_TZNAME_MAX: _bindgen_ty_13 = 6;
pub const _SC_JOB_CONTROL: _bindgen_ty_13 = 7;
pub const _SC_SAVED_IDS: _bindgen_ty_13 = 8;
pub const _SC_REALTIME_SIGNALS: _bindgen_ty_13 = 9;
pub const _SC_PRIORITY_SCHEDULING: _bindgen_ty_13 = 10;
pub const _SC_TIMERS: _bindgen_ty_13 = 11;
pub const _SC_ASYNCHRONOUS_IO: _bindgen_ty_13 = 12;
pub const _SC_PRIORITIZED_IO: _bindgen_ty_13 = 13;
pub const _SC_SYNCHRONIZED_IO: _bindgen_ty_13 = 14;
pub const _SC_FSYNC: _bindgen_ty_13 = 15;
pub const _SC_MAPPED_FILES: _bindgen_ty_13 = 16;
pub const _SC_MEMLOCK: _bindgen_ty_13 = 17;
pub const _SC_MEMLOCK_RANGE: _bindgen_ty_13 = 18;
pub const _SC_MEMORY_PROTECTION: _bindgen_ty_13 = 19;
pub const _SC_MESSAGE_PASSING: _bindgen_ty_13 = 20;
pub const _SC_SEMAPHORES: _bindgen_ty_13 = 21;
pub const _SC_SHARED_MEMORY_OBJECTS: _bindgen_ty_13 = 22;
pub const _SC_AIO_LISTIO_MAX: _bindgen_ty_13 = 23;
pub const _SC_AIO_MAX: _bindgen_ty_13 = 24;
pub const _SC_AIO_PRIO_DELTA_MAX: _bindgen_ty_13 = 25;
pub const _SC_DELAYTIMER_MAX: _bindgen_ty_13 = 26;
pub const _SC_MQ_OPEN_MAX: _bindgen_ty_13 = 27;
pub const _SC_MQ_PRIO_MAX: _bindgen_ty_13 = 28;
pub const _SC_VERSION: _bindgen_ty_13 = 29;
pub const _SC_PAGESIZE: _bindgen_ty_13 = 30;
pub const _SC_RTSIG_MAX: _bindgen_ty_13 = 31;
pub const _SC_SEM_NSEMS_MAX: _bindgen_ty_13 = 32;
pub const _SC_SEM_VALUE_MAX: _bindgen_ty_13 = 33;
pub const _SC_SIGQUEUE_MAX: _bindgen_ty_13 = 34;
pub const _SC_TIMER_MAX: _bindgen_ty_13 = 35;
pub const _SC_BC_BASE_MAX: _bindgen_ty_13 = 36;
pub const _SC_BC_DIM_MAX: _bindgen_ty_13 = 37;
pub const _SC_BC_SCALE_MAX: _bindgen_ty_13 = 38;
pub const _SC_BC_STRING_MAX: _bindgen_ty_13 = 39;
pub const _SC_COLL_WEIGHTS_MAX: _bindgen_ty_13 = 40;
pub const _SC_EQUIV_CLASS_MAX: _bindgen_ty_13 = 41;
pub const _SC_EXPR_NEST_MAX: _bindgen_ty_13 = 42;
pub const _SC_LINE_MAX: _bindgen_ty_13 = 43;
pub const _SC_RE_DUP_MAX: _bindgen_ty_13 = 44;
pub const _SC_CHARCLASS_NAME_MAX: _bindgen_ty_13 = 45;
pub const _SC_2_VERSION: _bindgen_ty_13 = 46;
pub const _SC_2_C_BIND: _bindgen_ty_13 = 47;
pub const _SC_2_C_DEV: _bindgen_ty_13 = 48;
pub const _SC_2_FORT_DEV: _bindgen_ty_13 = 49;
pub const _SC_2_FORT_RUN: _bindgen_ty_13 = 50;
pub const _SC_2_SW_DEV: _bindgen_ty_13 = 51;
pub const _SC_2_LOCALEDEF: _bindgen_ty_13 = 52;
pub const _SC_PII: _bindgen_ty_13 = 53;
pub const _SC_PII_XTI: _bindgen_ty_13 = 54;
pub const _SC_PII_SOCKET: _bindgen_ty_13 = 55;
pub const _SC_PII_INTERNET: _bindgen_ty_13 = 56;
pub const _SC_PII_OSI: _bindgen_ty_13 = 57;
pub const _SC_POLL: _bindgen_ty_13 = 58;
pub const _SC_SELECT: _bindgen_ty_13 = 59;
pub const _SC_UIO_MAXIOV: _bindgen_ty_13 = 60;
pub const _SC_IOV_MAX: _bindgen_ty_13 = 60;
pub const _SC_PII_INTERNET_STREAM: _bindgen_ty_13 = 61;
pub const _SC_PII_INTERNET_DGRAM: _bindgen_ty_13 = 62;
pub const _SC_PII_OSI_COTS: _bindgen_ty_13 = 63;
pub const _SC_PII_OSI_CLTS: _bindgen_ty_13 = 64;
pub const _SC_PII_OSI_M: _bindgen_ty_13 = 65;
pub const _SC_T_IOV_MAX: _bindgen_ty_13 = 66;
pub const _SC_THREADS: _bindgen_ty_13 = 67;
pub const _SC_THREAD_SAFE_FUNCTIONS: _bindgen_ty_13 = 68;
pub const _SC_GETGR_R_SIZE_MAX: _bindgen_ty_13 = 69;
pub const _SC_GETPW_R_SIZE_MAX: _bindgen_ty_13 = 70;
pub const _SC_LOGIN_NAME_MAX: _bindgen_ty_13 = 71;
pub const _SC_TTY_NAME_MAX: _bindgen_ty_13 = 72;
pub const _SC_THREAD_DESTRUCTOR_ITERATIONS: _bindgen_ty_13 = 73;
pub const _SC_THREAD_KEYS_MAX: _bindgen_ty_13 = 74;
pub const _SC_THREAD_STACK_MIN: _bindgen_ty_13 = 75;
pub const _SC_THREAD_THREADS_MAX: _bindgen_ty_13 = 76;
pub const _SC_THREAD_ATTR_STACKADDR: _bindgen_ty_13 = 77;
pub const _SC_THREAD_ATTR_STACKSIZE: _bindgen_ty_13 = 78;
pub const _SC_THREAD_PRIORITY_SCHEDULING: _bindgen_ty_13 = 79;
pub const _SC_THREAD_PRIO_INHERIT: _bindgen_ty_13 = 80;
pub const _SC_THREAD_PRIO_PROTECT: _bindgen_ty_13 = 81;
pub const _SC_THREAD_PROCESS_SHARED: _bindgen_ty_13 = 82;
pub const _SC_NPROCESSORS_CONF: _bindgen_ty_13 = 83;
pub const _SC_NPROCESSORS_ONLN: _bindgen_ty_13 = 84;
pub const _SC_PHYS_PAGES: _bindgen_ty_13 = 85;
pub const _SC_AVPHYS_PAGES: _bindgen_ty_13 = 86;
pub const _SC_ATEXIT_MAX: _bindgen_ty_13 = 87;
pub const _SC_PASS_MAX: _bindgen_ty_13 = 88;
pub const _SC_XOPEN_VERSION: _bindgen_ty_13 = 89;
pub const _SC_XOPEN_XCU_VERSION: _bindgen_ty_13 = 90;
pub const _SC_XOPEN_UNIX: _bindgen_ty_13 = 91;
pub const _SC_XOPEN_CRYPT: _bindgen_ty_13 = 92;
pub const _SC_XOPEN_ENH_I18N: _bindgen_ty_13 = 93;
pub const _SC_XOPEN_SHM: _bindgen_ty_13 = 94;
pub const _SC_2_CHAR_TERM: _bindgen_ty_13 = 95;
pub const _SC_2_C_VERSION: _bindgen_ty_13 = 96;
pub const _SC_2_UPE: _bindgen_ty_13 = 97;
pub const _SC_XOPEN_XPG2: _bindgen_ty_13 = 98;
pub const _SC_XOPEN_XPG3: _bindgen_ty_13 = 99;
pub const _SC_XOPEN_XPG4: _bindgen_ty_13 = 100;
pub const _SC_CHAR_BIT: _bindgen_ty_13 = 101;
pub const _SC_CHAR_MAX: _bindgen_ty_13 = 102;
pub const _SC_CHAR_MIN: _bindgen_ty_13 = 103;
pub const _SC_INT_MAX: _bindgen_ty_13 = 104;
pub const _SC_INT_MIN: _bindgen_ty_13 = 105;
pub const _SC_LONG_BIT: _bindgen_ty_13 = 106;
pub const _SC_WORD_BIT: _bindgen_ty_13 = 107;
pub const _SC_MB_LEN_MAX: _bindgen_ty_13 = 108;
pub const _SC_NZERO: _bindgen_ty_13 = 109;
pub const _SC_SSIZE_MAX: _bindgen_ty_13 = 110;
pub const _SC_SCHAR_MAX: _bindgen_ty_13 = 111;
pub const _SC_SCHAR_MIN: _bindgen_ty_13 = 112;
pub const _SC_SHRT_MAX: _bindgen_ty_13 = 113;
pub const _SC_SHRT_MIN: _bindgen_ty_13 = 114;
pub const _SC_UCHAR_MAX: _bindgen_ty_13 = 115;
pub const _SC_UINT_MAX: _bindgen_ty_13 = 116;
pub const _SC_ULONG_MAX: _bindgen_ty_13 = 117;
pub const _SC_USHRT_MAX: _bindgen_ty_13 = 118;
pub const _SC_NL_ARGMAX: _bindgen_ty_13 = 119;
pub const _SC_NL_LANGMAX: _bindgen_ty_13 = 120;
pub const _SC_NL_MSGMAX: _bindgen_ty_13 = 121;
pub const _SC_NL_NMAX: _bindgen_ty_13 = 122;
pub const _SC_NL_SETMAX: _bindgen_ty_13 = 123;
pub const _SC_NL_TEXTMAX: _bindgen_ty_13 = 124;
pub const _SC_XBS5_ILP32_OFF32: _bindgen_ty_13 = 125;
pub const _SC_XBS5_ILP32_OFFBIG: _bindgen_ty_13 = 126;
pub const _SC_XBS5_LP64_OFF64: _bindgen_ty_13 = 127;
pub const _SC_XBS5_LPBIG_OFFBIG: _bindgen_ty_13 = 128;
pub const _SC_XOPEN_LEGACY: _bindgen_ty_13 = 129;
pub const _SC_XOPEN_REALTIME: _bindgen_ty_13 = 130;
pub const _SC_XOPEN_REALTIME_THREADS: _bindgen_ty_13 = 131;
pub const _SC_ADVISORY_INFO: _bindgen_ty_13 = 132;
pub const _SC_BARRIERS: _bindgen_ty_13 = 133;
pub const _SC_BASE: _bindgen_ty_13 = 134;
pub const _SC_C_LANG_SUPPORT: _bindgen_ty_13 = 135;
pub const _SC_C_LANG_SUPPORT_R: _bindgen_ty_13 = 136;
pub const _SC_CLOCK_SELECTION: _bindgen_ty_13 = 137;
pub const _SC_CPUTIME: _bindgen_ty_13 = 138;
pub const _SC_THREAD_CPUTIME: _bindgen_ty_13 = 139;
pub const _SC_DEVICE_IO: _bindgen_ty_13 = 140;
pub const _SC_DEVICE_SPECIFIC: _bindgen_ty_13 = 141;
pub const _SC_DEVICE_SPECIFIC_R: _bindgen_ty_13 = 142;
pub const _SC_FD_MGMT: _bindgen_ty_13 = 143;
pub const _SC_FIFO: _bindgen_ty_13 = 144;
pub const _SC_PIPE: _bindgen_ty_13 = 145;
pub const _SC_FILE_ATTRIBUTES: _bindgen_ty_13 = 146;
pub const _SC_FILE_LOCKING: _bindgen_ty_13 = 147;
pub const _SC_FILE_SYSTEM: _bindgen_ty_13 = 148;
pub const _SC_MONOTONIC_CLOCK: _bindgen_ty_13 = 149;
pub const _SC_MULTI_PROCESS: _bindgen_ty_13 = 150;
pub const _SC_SINGLE_PROCESS: _bindgen_ty_13 = 151;
pub const _SC_NETWORKING: _bindgen_ty_13 = 152;
pub const _SC_READER_WRITER_LOCKS: _bindgen_ty_13 = 153;
pub const _SC_SPIN_LOCKS: _bindgen_ty_13 = 154;
pub const _SC_REGEXP: _bindgen_ty_13 = 155;
pub const _SC_REGEX_VERSION: _bindgen_ty_13 = 156;
pub const _SC_SHELL: _bindgen_ty_13 = 157;
pub const _SC_SIGNALS: _bindgen_ty_13 = 158;
pub const _SC_SPAWN: _bindgen_ty_13 = 159;
pub const _SC_SPORADIC_SERVER: _bindgen_ty_13 = 160;
pub const _SC_THREAD_SPORADIC_SERVER: _bindgen_ty_13 = 161;
pub const _SC_SYSTEM_DATABASE: _bindgen_ty_13 = 162;
pub const _SC_SYSTEM_DATABASE_R: _bindgen_ty_13 = 163;
pub const _SC_TIMEOUTS: _bindgen_ty_13 = 164;
pub const _SC_TYPED_MEMORY_OBJECTS: _bindgen_ty_13 = 165;
pub const _SC_USER_GROUPS: _bindgen_ty_13 = 166;
pub const _SC_USER_GROUPS_R: _bindgen_ty_13 = 167;
pub const _SC_2_PBS: _bindgen_ty_13 = 168;
pub const _SC_2_PBS_ACCOUNTING: _bindgen_ty_13 = 169;
pub const _SC_2_PBS_LOCATE: _bindgen_ty_13 = 170;
pub const _SC_2_PBS_MESSAGE: _bindgen_ty_13 = 171;
pub const _SC_2_PBS_TRACK: _bindgen_ty_13 = 172;
pub const _SC_SYMLOOP_MAX: _bindgen_ty_13 = 173;
pub const _SC_STREAMS: _bindgen_ty_13 = 174;
pub const _SC_2_PBS_CHECKPOINT: _bindgen_ty_13 = 175;
pub const _SC_V6_ILP32_OFF32: _bindgen_ty_13 = 176;
pub const _SC_V6_ILP32_OFFBIG: _bindgen_ty_13 = 177;
pub const _SC_V6_LP64_OFF64: _bindgen_ty_13 = 178;
pub const _SC_V6_LPBIG_OFFBIG: _bindgen_ty_13 = 179;
pub const _SC_HOST_NAME_MAX: _bindgen_ty_13 = 180;
pub const _SC_TRACE: _bindgen_ty_13 = 181;
pub const _SC_TRACE_EVENT_FILTER: _bindgen_ty_13 = 182;
pub const _SC_TRACE_INHERIT: _bindgen_ty_13 = 183;
pub const _SC_TRACE_LOG: _bindgen_ty_13 = 184;
pub const _SC_LEVEL1_ICACHE_SIZE: _bindgen_ty_13 = 185;
pub const _SC_LEVEL1_ICACHE_ASSOC: _bindgen_ty_13 = 186;
pub const _SC_LEVEL1_ICACHE_LINESIZE: _bindgen_ty_13 = 187;
pub const _SC_LEVEL1_DCACHE_SIZE: _bindgen_ty_13 = 188;
pub const _SC_LEVEL1_DCACHE_ASSOC: _bindgen_ty_13 = 189;
pub const _SC_LEVEL1_DCACHE_LINESIZE: _bindgen_ty_13 = 190;
pub const _SC_LEVEL2_CACHE_SIZE: _bindgen_ty_13 = 191;
pub const _SC_LEVEL2_CACHE_ASSOC: _bindgen_ty_13 = 192;
pub const _SC_LEVEL2_CACHE_LINESIZE: _bindgen_ty_13 = 193;
pub const _SC_LEVEL3_CACHE_SIZE: _bindgen_ty_13 = 194;
pub const _SC_LEVEL3_CACHE_ASSOC: _bindgen_ty_13 = 195;
pub const _SC_LEVEL3_CACHE_LINESIZE: _bindgen_ty_13 = 196;
pub const _SC_LEVEL4_CACHE_SIZE: _bindgen_ty_13 = 197;
pub const _SC_LEVEL4_CACHE_ASSOC: _bindgen_ty_13 = 198;
pub const _SC_LEVEL4_CACHE_LINESIZE: _bindgen_ty_13 = 199;
pub const _SC_IPV6: _bindgen_ty_13 = 235;
pub const _SC_RAW_SOCKETS: _bindgen_ty_13 = 236;
pub const _SC_V7_ILP32_OFF32: _bindgen_ty_13 = 237;
pub const _SC_V7_ILP32_OFFBIG: _bindgen_ty_13 = 238;
pub const _SC_V7_LP64_OFF64: _bindgen_ty_13 = 239;
pub const _SC_V7_LPBIG_OFFBIG: _bindgen_ty_13 = 240;
pub const _SC_SS_REPL_MAX: _bindgen_ty_13 = 241;
pub const _SC_TRACE_EVENT_NAME_MAX: _bindgen_ty_13 = 242;
pub const _SC_TRACE_NAME_MAX: _bindgen_ty_13 = 243;
pub const _SC_TRACE_SYS_MAX: _bindgen_ty_13 = 244;
pub const _SC_TRACE_USER_EVENT_MAX: _bindgen_ty_13 = 245;
pub const _SC_XOPEN_STREAMS: _bindgen_ty_13 = 246;
pub const _SC_THREAD_ROBUST_PRIO_INHERIT: _bindgen_ty_13 = 247;
pub const _SC_THREAD_ROBUST_PRIO_PROTECT: _bindgen_ty_13 = 248;
pub type _bindgen_ty_13 = u32;
pub const _CS_PATH: _bindgen_ty_14 = 0;
pub const _CS_V6_WIDTH_RESTRICTED_ENVS: _bindgen_ty_14 = 1;
pub const _CS_GNU_LIBC_VERSION: _bindgen_ty_14 = 2;
pub const _CS_GNU_LIBPTHREAD_VERSION: _bindgen_ty_14 = 3;
pub const _CS_V5_WIDTH_RESTRICTED_ENVS: _bindgen_ty_14 = 4;
pub const _CS_V7_WIDTH_RESTRICTED_ENVS: _bindgen_ty_14 = 5;
pub const _CS_LFS_CFLAGS: _bindgen_ty_14 = 1000;
pub const _CS_LFS_LDFLAGS: _bindgen_ty_14 = 1001;
pub const _CS_LFS_LIBS: _bindgen_ty_14 = 1002;
pub const _CS_LFS_LINTFLAGS: _bindgen_ty_14 = 1003;
pub const _CS_LFS64_CFLAGS: _bindgen_ty_14 = 1004;
pub const _CS_LFS64_LDFLAGS: _bindgen_ty_14 = 1005;
pub const _CS_LFS64_LIBS: _bindgen_ty_14 = 1006;
pub const _CS_LFS64_LINTFLAGS: _bindgen_ty_14 = 1007;
pub const _CS_XBS5_ILP32_OFF32_CFLAGS: _bindgen_ty_14 = 1100;
pub const _CS_XBS5_ILP32_OFF32_LDFLAGS: _bindgen_ty_14 = 1101;
pub const _CS_XBS5_ILP32_OFF32_LIBS: _bindgen_ty_14 = 1102;
pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS: _bindgen_ty_14 = 1103;
pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS: _bindgen_ty_14 = 1104;
pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_14 = 1105;
pub const _CS_XBS5_ILP32_OFFBIG_LIBS: _bindgen_ty_14 = 1106;
pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_14 = 1107;
pub const _CS_XBS5_LP64_OFF64_CFLAGS: _bindgen_ty_14 = 1108;
pub const _CS_XBS5_LP64_OFF64_LDFLAGS: _bindgen_ty_14 = 1109;
pub const _CS_XBS5_LP64_OFF64_LIBS: _bindgen_ty_14 = 1110;
pub const _CS_XBS5_LP64_OFF64_LINTFLAGS: _bindgen_ty_14 = 1111;
pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_14 = 1112;
pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_14 = 1113;
pub const _CS_XBS5_LPBIG_OFFBIG_LIBS: _bindgen_ty_14 = 1114;
pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_14 = 1115;
pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS: _bindgen_ty_14 = 1116;
pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS: _bindgen_ty_14 = 1117;
pub const _CS_POSIX_V6_ILP32_OFF32_LIBS: _bindgen_ty_14 = 1118;
pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS: _bindgen_ty_14 = 1119;
pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS: _bindgen_ty_14 = 1120;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_14 = 1121;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS: _bindgen_ty_14 = 1122;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_14 = 1123;
pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS: _bindgen_ty_14 = 1124;
pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS: _bindgen_ty_14 = 1125;
pub const _CS_POSIX_V6_LP64_OFF64_LIBS: _bindgen_ty_14 = 1126;
pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS: _bindgen_ty_14 = 1127;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_14 = 1128;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_14 = 1129;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS: _bindgen_ty_14 = 1130;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_14 = 1131;
pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS: _bindgen_ty_14 = 1132;
pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS: _bindgen_ty_14 = 1133;
pub const _CS_POSIX_V7_ILP32_OFF32_LIBS: _bindgen_ty_14 = 1134;
pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS: _bindgen_ty_14 = 1135;
pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS: _bindgen_ty_14 = 1136;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_14 = 1137;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS: _bindgen_ty_14 = 1138;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_14 = 1139;
pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS: _bindgen_ty_14 = 1140;
pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS: _bindgen_ty_14 = 1141;
pub const _CS_POSIX_V7_LP64_OFF64_LIBS: _bindgen_ty_14 = 1142;
pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS: _bindgen_ty_14 = 1143;
